[
  {
    "name": "St. Albert the Great",
    "title": "Doctor of the Church, Universal Doctor",
    "description": "A German Dominican friar and bishop who was one of the greatest medieval scholars. Known as the 'Universal Doctor' for his vast knowledge spanning theology, philosophy, natural sciences, and alchemy. He was the teacher of St. Thomas Aquinas and helped introduce Aristotelian philosophy to Christian thought. His scientific observations and experiments made him a pioneer in natural sciences. He harmonized faith and reason, showing that scientific inquiry could deepen understanding of God's creation.",
    "feastDay": "November 15",
    "born": "1200",
    "died": "1280",
    "patronOf": "Natural sciences, philosophers, medical technicians, scientists",
    "prayer": "St. Albert the Great, guide us in learning and help us use knowledge to serve God and humanity.",
    "favors": "Wisdom, learning, and guidance in science and theology",
    "categories": ["Studies"]
  },
  {
    "name": "St. Aloysius Gonzaga",
    "title": "Patron of Youth",
    "description": "An Italian Jesuit novice who died at age 23 while caring for plague victims in Rome. Born into nobility, he renounced his inheritance to serve God and the poor. Known for his extraordinary purity, devotion to prayer, and care for the sick. He contracted the plague while ministering to victims and died shortly after. His youthful holiness and dedication to service make him a powerful patron for young people seeking to live pure lives.",
    "feastDay": "June 21",
    "born": "1568",
    "died": "1591",
    "patronOf": "Youth, students, plague victims, AIDS patients",
    "prayer": "St. Aloysius Gonzaga, patron of youth, help young people live in purity and serve others with love.",
    "favors": "Purity, youth holiness, and help in resisting temptation",
    "categories": ["Family", "Studies"]
  },
  {
    "name": "St. Alphonsus Liguori",
    "title": "Doctor of the Church, Moral Theologian",
    "description": "An Italian bishop who founded the Redemptorists and became a leading moral theologian. Initially a lawyer, he became a priest after a courtroom defeat that he saw as God's call. He developed a balanced approach to moral theology, avoiding both laxity and excessive rigor. His numerous writings on prayer, spirituality, and moral guidance remain influential. He was known for his pastoral care and his ability to make complex theological concepts accessible to ordinary people.",
    "feastDay": "August 1",
    "born": "1696",
    "died": "1787",
    "patronOf": "Moral theologians, confessors, vocations",
    "prayer": "St. Alphonsus Liguori, guide us in moral decisions and help us grow in prayer and virtue.",
    "favors": "Guidance in moral decisions, help with spiritual struggles, and encouragement in prayer",
    "categories": ["Studies"]
  },
  {
    "name": "St. Ambrose",
    "title": "Doctor of the Church, Bishop of Milan",
    "description": "A Roman governor who became Bishop of Milan and one of the four great Latin Doctors of the Church. Though unbaptized when chosen as bishop, he quickly proved himself a brilliant theologian and church leader. He famously stood up to Emperor Theodosius, demanding penance for a massacre. His preaching helped convert St. Augustine, and his hymns enriched the Church's liturgical life. He defended orthodoxy against Arianism and established important precedents for church-state relations.",
    "feastDay": "December 7",
    "born": "340",
    "died": "397",
    "patronOf": "Milan, bee keepers, candlemakers, learning",
    "prayer": "St. Ambrose, fearless defender of truth, give us wisdom and courage to preach the Gospel.",
    "favors": "Wisdom, courage in preaching, and help in conversion",
    "categories": ["Studies"]
  },
  {
    "name": "St. Andre Bessette",
    "title": "Miracle Man of Mount Royal",
    "description": "A French-Canadian Holy Cross brother who served as porter at Notre Dame College in Montreal for 40 years. Known for his devotion to St. Joseph and his healing ministry, he received thousands of visitors seeking prayer and healing. Despite poor health and limited education, he became famous for miraculous cures attributed to his intercession. He built the Oratory of St. Joseph on Mount Royal, which became a major pilgrimage site. His simple faith and compassion drew people from across North America.",
    "feastDay": "January 6",
    "born": "1845",
    "died": "1937",
    "patronOf": "Holy Cross Brothers, doorkeepers, the sick",
    "prayer": "St. Andre Bessette, humble brother, bring healing to the sick and strengthen our devotion to St. Joseph.",
    "favors": "Healing, comfort to the sick, and aid in miracles",
    "categories": ["Healing"]
  },
  {
    "name": "St. Andrew Avellino",
    "title": "Theatine Reformer",
    "description": "An Italian Theatine priest known for his efforts to reform the clergy and his spiritual writings. Originally a lawyer and secular priest, he joined the Theatines after a moment of dishonesty in court led to his conversion. He worked tirelessly to reform corrupt clergy and was known for his holiness and miraculous healings. He died while celebrating Mass, fulfilling his prayer to die at the altar. His dedication to priestly reform and personal holiness made him a model for clergy.",
    "feastDay": "November 10",
    "born": "1521",
    "died": "1608",
    "patronOf": "Naples, Sicily, sudden death",
    "prayer": "St. Andrew Avellino, help priests live holy lives and give us perseverance in virtue.",
    "favors": "Perseverance in virtue, aid in spiritual struggles, and healing",
    "categories": ["Healing"]
  },
  {
    "name": "St. Anthony Mary Claret",
    "title": "Archbishop and Missionary",
    "description": "A Spanish archbishop and founder of the Claretian Missionaries who worked tirelessly for reform and evangelization. He preached thousands of missions throughout Spain and later served as Archbishop of Cuba, where he fought slavery and worked for social justice. He founded a religious congregation, wrote numerous books, and promoted education. He served as confessor to Queen Isabella II of Spain. His zeal for souls and social justice made him many enemies but also brought many conversions.",
    "feastDay": "October 24",
    "born": "1807",
    "died": "1870",
    "patronOf": "Claretian Missionaries, weavers, savings banks",
    "prayer": "St. Anthony Mary Claret, zealous missionary, inspire us to spread the Gospel with courage and love.",
    "favors": "Courage in faith, help in missions, and healing",
    "categories": ["Healing"]
  },
  {
    "name": "St. Augustine",
    "title": "Doctor of the Church, Bishop of Hippo",
    "description": "One of the greatest theologians in Christian history, Augustine lived a dissolute youth before his dramatic conversion through his mother's prayers and St. Ambrose's preaching. His 'Confessions' and 'City of God' are masterworks of Christian literature. As Bishop of Hippo in North Africa, he defended orthodox Christianity against various heresies. His theology profoundly influenced Western Christianity, particularly his understanding of grace, original sin, and predestination. His intellectual journey from skepticism to faith continues to inspire seekers.",
    "feastDay": "August 28",
    "born": "354",
    "died": "430",
    "patronOf": "Theologians, converts, those with eye troubles",
    "prayer": "St. Augustine, great convert, help us find truth and strengthen our faith through study and prayer.",
    "favors": "Help with conversion, wisdom in theology, and strengthening of faith",
    "categories": ["Studies"]
  },
  {
    "name": "St. Basil the Great",
    "title": "Doctor of the Church, Cappadocian Father",
    "description": "One of the three Cappadocian Fathers who defended orthodox Christianity against Arianism. As Bishop of Caesarea, he organized relief for the poor during a famine and established a complex of charitable institutions. His monastic rule influenced Eastern monasticism, and his liturgical reforms shaped Eastern worship. He was known for his eloquent preaching, theological writings, and administrative skills. His defense of the divinity of the Holy Spirit was crucial in the development of Trinitarian doctrine.",
    "feastDay": "January 2",
    "born": "330",
    "died": "379",
    "patronOf": "Hospital administrators, reformers, monks",
    "prayer": "St. Basil the Great, defender of truth, give us wisdom and strength to serve the Church faithfully.",
    "favors": "Wisdom, strength in faith, and help with leadership",
    "categories": ["Studies"]
  },
  {
    "name": "St. Benedict Joseph Labre",
    "title": "Beggar Saint",
    "description": "A French laymen who lived as a homeless pilgrim, traveling to shrines across Europe. After unsuccessful attempts at religious life, he embraced radical poverty and spent his days in prayer, visiting churches and caring for other poor people. He lived on alms and slept outdoors or in ruins. Despite his unusual lifestyle, he was known for his holiness and charity to other beggars. His radical witness to Gospel poverty challenged conventional religious life and attracted many followers.",
    "feastDay": "April 16",
    "born": "1748",
    "died": "1783",
    "patronOf": "Homeless people, beggars, pilgrims",
    "prayer": "St. Benedict Joseph Labre, help us find God in poverty and serve the homeless with compassion.",
    "favors": "Help with homelessness, pilgrimage, and perseverance in poverty",
    "categories": ["Healing"]
  },
  {
    "name": "St. Benedict",
    "title": "Father of Western Monasticism",
    "description": "The founder of Western monasticism who wrote the Rule of St. Benedict, which has guided monastic life for over 1,500 years. Born into a wealthy Roman family, he abandoned his studies to become a hermit, later founding twelve monasteries. His rule emphasized prayer, work, study, and community life in perfect balance. He is known for many miracles including raising the dead and moving a lake. His motto 'Pray and Work' became the foundation of monastic spirituality that preserved learning through the Dark Ages.",
    "feastDay": "July 11",
    "born": "480",
    "died": "547",
    "patronOf": "Europe, monks, students, farmers",
    "prayer": "St. Benedict, father of monks, help us balance prayer and work in our daily lives.",
    "favors": "Protection from evil, help in temptation, and guidance in prayer",
    "categories": ["Studies", "Protection"]
  },
  {
    "name": "St. Bernadette of Lourdes",
    "title": "Visionary of Lourdes",
    "description": "A French peasant girl who witnessed eighteen apparitions of the Virgin Mary at Lourdes in 1858. Despite skepticism and opposition, she faithfully reported Mary's messages about prayer, penance, and the building of a chapel. She later became a Sister of Charity and lived a hidden life of prayer and suffering. The spring Mary showed her has brought countless healings, and Lourdes became one of the world's greatest pilgrimage sites. Her simplicity and fidelity to her visions inspire trust in God's choice of the humble.",
    "feastDay": "April 16",
    "born": "1844",
    "died": "1879",
    "patronOf": "Sick people, poverty, shepherds",
    "prayer": "St. Bernadette, faithful witness, help us trust in Mary's intercession and grow in faith through suffering.",
    "favors": "Healing, faith in suffering, and courage in trials",
    "categories": ["Healing"]
  },
  {
    "name": "St. Bernardine of Siena",
    "title": "Apostle of the Holy Name",
    "description": "An Italian Franciscan friar famous for his preaching and devotion to the Holy Name of Jesus. He traveled throughout Italy preaching missions that brought about conversions and moral reform. He promoted devotion to the monogram IHS (Jesus) and carried a tablet with this symbol while preaching. His eloquent sermons attacked corruption and promoted peace between warring factions. He three times refused episcopal appointments to continue his missionary work. His preaching style influenced generations of preachers.",
    "feastDay": "May 20",
    "born": "1380",
    "died": "1444",
    "patronOf": "Communications, advertising, chest problems",
    "prayer": "St. Bernardine of Siena, powerful preacher, help us proclaim the Holy Name of Jesus with zeal.",
    "favors": "Help in preaching, peace in the family, and aid in conversion",
    "categories": ["Family"]
  },
  {
    "name": "St. Bernard of Clairvaux",
    "title": "Doctor of the Church, Cistercian Abbot",
    "description": "A French Cistercian abbot known as the 'Last of the Fathers' for his profound spiritual writings. He joined the Cistercians with thirty companions and founded numerous monasteries. His mystical writings on the love of God influenced medieval spirituality, and his devotion to Mary advanced Marian theology. He preached the Second Crusade and mediated political disputes. His sermons on the Song of Songs and treatises on grace and free will remain spiritual classics. He combined contemplative depth with active involvement in Church affairs.",
    "feastDay": "August 20",
    "born": "1090",
    "died": "1153",
    "patronOf": "Cistercians, candlemakers, Gibraltar",
    "prayer": "St. Bernard of Clairvaux, lover of God, deepen our devotion to Jesus and Mary.",
    "favors": "Wisdom, courage in faith, and help with devotion to the Sacred Heart",
    "categories": ["Studies", "Family"]
  },
  {
    "name": "St. Brendan",
    "title": "Navigator Saint",
    "description": "An Irish monk and abbot famous for his legendary voyage in search of the 'Land of Promise.' According to the popular medieval tale, he and his companions sailed across the Atlantic in a leather boat, encountering various islands and wonders. While the fantastic elements are mythical, Brendan was a real missionary who founded several monasteries in Ireland and possibly traveled to Scotland and Wales. His story inspired medieval exploration and represents the Irish monastic missionary spirit.",
    "feastDay": "May 16",
    "born": "484",
    "died": "577",
    "patronOf": "Sailors, travelers, whales, Kerry",
    "prayer": "St. Brendan the Navigator, guide us safely through life's journeys and help us seek God in all things.",
    "favors": "Safe travels, courage in faith, and help with navigation of life's challenges",
    "categories": ["Journey Mercy", "Protection"]
  },
  {
    "name": "St. Brigid of Ireland",
    "title": "Mary of the Gael",
    "description": "One of Ireland's three patron saints, Brigid was an abbess who founded the monastery of Kildare and is considered the first Irish nun. Known for her charity to the poor and her miraculous powers, she established scriptoriums and schools that became centers of learning. Many legends surround her life, including stories of multiplying food for the hungry and healing the sick. Her feast day marking the beginning of spring made her beloved among farming communities. She represents the strong tradition of Irish women in religious life.",
    "feastDay": "February 1",
    "born": "451",
    "died": "525",
    "patronOf": "Ireland, dairy workers, cattle, midwives",
    "prayer": "St. Brigid of Ireland, generous saint, help us care for the poor and protect our homes and families.",
    "favors": "Healing, protection of homes, and help with fertility",
    "categories": ["Family", "Healing"]
  }
]