[
  {
    "name": "St. Catherine of Alexandria",
    "title": "Virgin and Martyr",
    "description": "A learned young woman who challenged Emperor Maxentius about his persecution of Christians. According to tradition, she defeated fifty philosophers in debate about Christianity, leading to their conversion. When tortured on a spiked wheel (now called Catherine wheel), it broke miraculously. She was finally beheaded, and angels carried her body to Mount Sinai. Though historical details are uncertain, her cult became widespread in medieval Europe. She represents the harmony of faith and learning.",
    "feastDay": "November 25",
    "born": "287",
    "died": "305",
    "patronOf": "Students, philosophers, librarians, wheelwrights",
    "prayer": "St. Catherine of Alexandria, wise virgin, help us defend our faith with wisdom and courage.",
    "favors": "Wisdom, courage in faith, and help with studies",
    "categories": ["Studies"]
  },
  {
    "name": "St. Charbel",
    "title": "Hermit of Lebanon",
    "description": "A Lebanese Maronite monk who lived as a hermit for 23 years in complete solitude and prayer. Known for his extreme asceticism, mystical experiences, and miraculous healings. After his death, his body remained incorrupt and exuded a mysterious oil with healing properties. Pilgrims from all faiths visit his tomb seeking miracles. His simple life of prayer and penance in the Lebanese mountains attracts people worldwide seeking healing and spiritual guidance.",
    "feastDay": "July 24",
    "born": "1828",
    "died": "1898",
    "patronOf": "Lebanon, hermits, the sick",
    "prayer": "St. Charbel, holy hermit, intercede for our healing and help us find God in silence and prayer.",
    "favors": "Healing, strength in suffering, and miraculous interventions",
    "categories": ["Healing"]
  },
  {
    "name": "St. Charles Borromeo",
    "title": "Counter-Reformation Saint",
    "description": "An Italian cardinal and archbishop who led the Counter-Reformation and implemented the reforms of the Council of Trent. Despite his wealth and position, he lived simply and gave generously to the poor. He established seminaries, reformed clergy, and personally cared for plague victims in Milan. His pastoral visits, catechetical programs, and charitable works transformed the archdiocese. He died young but left a lasting impact on Church reform and pastoral care.",
    "feastDay": "November 4",
    "born": "1538",
    "died": "1584",
    "patronOf": "Seminarians, catechists, spiritual directors",
    "prayer": "St. Charles Borromeo, faithful shepherd, help us reform our lives and serve the Church faithfully.",
    "favors": "Guidance in reform, help with priests, and courage in faith",
    "categories": ["Studies"]
  },
  {
    "name": "St. Colette",
    "title": "Reformer of Poor Clares",
    "description": "A French Poor Clare who reformed her order and returned it to strict observance of the rule. After living as a hermit, she received visions calling her to reform the Franciscan order. Despite initial resistance, she successfully established reformed convents throughout Europe. She emphasized poverty, enclosure, and contemplative prayer while maintaining active concern for the poor. Her reforms helped revitalize religious life and inspire greater devotion.",
    "feastDay": "March 6",
    "born": "1381",
    "died": "1447",
    "patronOf": "Women seeking to become pregnant, sick children",
    "prayer": "St. Colette, faithful reformer, help us return to authentic Gospel living and serve others with love.",
    "favors": "Healing, help with conversions, and courage in faith",
    "categories": ["Healing"]
  },
  {
    "name": "St. Cyril of Jerusalem",
    "title": "Doctor of the Church",
    "description": "A 4th-century bishop of Jerusalem famous for his catechetical lectures to candidates for baptism. His detailed instructions on Christian doctrine, particularly the Eucharist and baptism, provide valuable insights into early Church liturgy and belief. He defended orthodox Christianity against Arianism despite persecution and exile. His systematic approach to religious education influenced catechetical methods for centuries. His feast day lectures remain important sources for understanding early Christian worship.",
    "feastDay": "March 18",
    "born": "315",
    "died": "386",
    "patronOf": "Catechists, religious education",
    "prayer": "St. Cyril of Jerusalem, teacher of faith, help us understand Scripture and grow in knowledge of God.",
    "favors": "Help with understanding Scripture, wisdom, and faithfulness",
    "categories": ["Studies"]
  },
  {
    "name": "St. Damien of Molokai",
    "title": "Apostle to the Lepers",
    "description": "A Belgian priest who volunteered to minister to lepers on the isolated Hawaiian island of Molokai. He lived among the outcasts for 16 years, building churches, schools, and hospitals while providing spiritual and physical care. He eventually contracted leprosy himself but continued his ministry until death. His sacrifice brought international attention to the plight of lepers and led to improved conditions. He represents heroic charity and solidarity with the marginalized.",
    "feastDay": "May 10",
    "born": "1840",
    "died": "1889",
    "patronOf": "Lepers, outcasts, Hawaii",
    "prayer": "St. Damien of Molokai, servant of the outcasts, help us care for the sick and marginalized.",
    "favors": "Healing, strength in suffering, and aid in caring for the sick",
    "categories": ["Healing"]
  },
  {
    "name": "St. Dominic Savio",
    "title": "Student Saint",
    "description": "An Italian student of St. John Bosco who died at age 14 after living a remarkably holy life. Known for his purity, devotion to the Eucharist, and charity toward fellow students. He made heroic efforts to prevent sin and bring peace among his classmates. His early death was preceded by mystical experiences and prophecies. His youthful sanctity shows that heroic virtue is possible even for children and teenagers.",
    "feastDay": "March 9",
    "born": "1842",
    "died": "1857",
    "patronOf": "Students, choirboys, juvenile delinquents",
    "prayer": "St. Dominic Savio, pure student, help young people live holy lives and resist temptation.",
    "favors": "Purity, youth holiness, and perseverance",
    "categories": ["Studies", "Family"]
  },
  {
    "name": "St. Dominic",
    "title": "Founder of the Dominican Order",
    "description": "A Spanish priest who founded the Order of Preachers (Dominicans) to combat heresy through preaching and study. Moved by the Albigensian heresy in southern France, he developed a new form of religious life combining contemplation with active preaching. His followers emphasized learning, poverty, and preaching the Gospel. According to tradition, he received the Rosary from Mary as a weapon against heresy. His order produced many saints and scholars who shaped medieval Christianity.",
    "feastDay": "August 8",
    "born": "1170",
    "died": "1221",
    "patronOf": "Dominicans, astronomers, scientists",
    "prayer": "St. Dominic, zealous preacher, help us proclaim the Gospel through word and example.",
    "favors": "Help with preaching, aid in conversion, and courage in faith",
    "categories": ["Studies"]
  },
  {
    "name": "St. Edith Stein",
    "title": "St. Teresa Benedicta of the Cross",
    "description": "A German Jewish philosopher who converted to Catholicism and became a Carmelite nun before dying in Auschwitz. A brilliant student of phenomenology, she taught and wrote on philosophy and women's issues before her conversion. As Sister Teresa Benedicta, she continued writing on spirituality and the cross. She was murdered in the Holocaust along with her sister Rosa. She represents the dialogue between faith and reason, Judaism and Christianity.",
    "feastDay": "August 9",
    "born": "1891",
    "died": "1942",
    "patronOf": "Europe, philosophers, martyrs",
    "prayer": "St. Edith Stein, seeker of truth, help us find God through reason and embrace the cross with love.",
    "favors": "Help with faith, courage in suffering, and strength in trials",
    "categories": ["Studies"]
  },
  {
    "name": "St. Elizabeth Ann Seton",
    "title": "First American-born Saint",
    "description": "An American widow who converted from Episcopalianism to Catholicism and founded the American Sisters of Charity. After her husband's death, she struggled financially while raising five children. Her conversion cost her friends and family support but opened new doors for service. She established the first American Catholic school system and founded St. Joseph's Academy. Her educational work laid the foundation for Catholic education in America.",
    "feastDay": "January 4",
    "born": "1774",
    "died": "1821",
    "patronOf": "Catholic schools, widows, seafarers",
    "prayer": "St. Elizabeth Ann Seton, faithful mother, help us trust in God's providence and serve through education.",
    "favors": "Help with family life, education, and perseverance in faith",
    "categories": ["Family", "Studies"]
  },
  {
    "name": "St. Elizabeth of Hungary",
    "title": "Princess of Charity",
    "description": "A Hungarian princess who dedicated her life to caring for the poor and sick. Married at 14 to the Landgrave of Thuringia, she used her position to help the needy, often against court opposition. After her husband's death on crusade, she was expelled from court and lived in poverty. She built hospitals and personally cared for lepers and outcasts. Her charitable works and mystical experiences made her beloved among the poor and led to quick canonization.",
    "feastDay": "November 17",
    "born": "1207",
    "died": "1231",
    "patronOf": "Charitable societies, bakers, beggars",
    "prayer": "St. Elizabeth of Hungary, charitable princess, help us serve the poor with generous hearts.",
    "favors": "Aid to the poor, healing, and charity",
    "categories": ["Healing"]
  },
  {
    "name": "St. Elizabeth of Portugal",
    "title": "Peacemaker Queen",
    "description": "A Portuguese queen known for her efforts to make peace between warring factions and her charitable works. She mediated conflicts between her husband and son and between Portugal and neighboring kingdoms. After her husband's death, she became a Franciscan tertiary and dedicated herself to prayer and charity. She founded hospitals, orphanages, and shelters for pilgrims. Her diplomatic skills and holiness earned her the title 'Peacemaker' and made her a powerful intercessor for family harmony.",
    "feastDay": "July 4",
    "born": "1271",
    "died": "1336",
    "patronOf": "Brides, difficult marriages, peace",
    "prayer": "St. Elizabeth of Portugal, peacemaker queen, bring harmony to families and heal divisions.",
    "favors": "Peace in the family, healing, and charity",
    "categories": ["Family", "Healing"]
  },
  {
    "name": "St. Elizabeth (Mother of John the Baptist)",
    "title": "Mother of the Forerunner",
    "description": "The mother of John the Baptist and cousin of the Virgin Mary. Married to the priest Zechariah, she was barren until an angel announced she would bear a son in her old age. When Mary visited her during pregnancy, Elizabeth's baby leaped in her womb, and she proclaimed Mary 'blessed among women.' Her Magnificat shows her deep faith and understanding of God's plan. She represents the faithful preparation for Christ's coming.",
    "feastDay": "November 5",
    "born": "1st century BC",
    "died": "1st century AD",
    "patronOf": "Pregnant women, infertile couples",
    "prayer": "St. Elizabeth, faithful mother, help us recognize God's presence and support one another in faith.",
    "favors": "Help with family, courage, and faith",
    "categories": ["Family"]
  },
  {
    "name": "St. Frances of Rome",
    "title": "Patron of Motorists",
    "description": "An Italian wife and mother who balanced family duties with intense spiritual life and charitable works. Despite desiring religious life, she married and had three children, seeing family life as her path to holiness. She founded a congregation of oblates and was known for her visions of her guardian angel. After her husband's death, she joined her congregation. Her ability to combine mystical experiences with practical charity made her beloved in Rome.",
    "feastDay": "March 9",
    "born": "1384",
    "died": "1440",
    "patronOf": "Motorists, widows, oblates",
    "prayer": "St. Frances of Rome, devoted wife and mother, help us find holiness in our daily duties.",
    "favors": "Help with family life, patience, and charity",
    "categories": ["Family"]
  },
  {
    "name": "St. Frances Xavier Cabrini",
    "title": "Mother Cabrini",
    "description": "An Italian-American nun who worked with Italian immigrants in the United States. Despite poor health, she founded schools, hospitals, and orphanages across America and South America. She originally wanted to be a missionary to China but was directed by Pope Leo XIII to work with Italian immigrants in America. She became an American citizen and was the first American citizen to be canonized. Her institutions served the poor and marginalized immigrant communities.",
    "feastDay": "November 13",
    "born": "1850",
    "died": "1917",
    "patronOf": "Immigrants, hospital administrators, orphans",
    "prayer": "St. Frances Xavier Cabrini, mother of immigrants, help us welcome strangers and care for the needy.",
    "favors": "Protection in travel, help with missions, and healing",
    "categories": ["Healing", "Journey Mercy"]
  }
]