[
  {
    "name": "St. John Bosco",
    "title": "Father and Teacher of Youth",
    "description": "An Italian priest who dedicated his life to educating poor boys in Turin. He developed the preventive system of education based on reason, religion, and kindness rather than punishment. He founded the Salesian Congregation and established schools, workshops, and churches throughout Italy. Known for his prophetic dreams and ability to read hearts, he also wrote popular books and founded a printing press. His work with youth earned him the title 'Father and Teacher of Youth.'",
    "feastDay": "January 31",
    "born": "1815",
    "died": "1888",
    "patronOf": "Youth, students, editors, publishers",
    "prayer": "St. John Bosco, father of youth, help us guide young people with wisdom and love.",
    "favors": "Help with youth, education, and guidance in faith",
    "categories": ["Studies", "Family"]
  },
  {
    "name": "St. John Neumann",
    "title": "American Bishop and Educator",
    "description": "A Bohemian-born Redemptorist who became the fourth Bishop of Philadelphia and advanced Catholic education in America. He established the first diocesan Catholic school system in the United States and increased the number of Catholic schools from one to 200. He was known for his humility, pastoral care, and devotion to the Eucharist. Despite initial resistance to his European ways, he transformed the diocese through his educational initiatives and personal holiness.",
    "feastDay": "January 5",
    "born": "1811",
    "died": "1860",
    "patronOf": "Catholic education, immigrants, sick children",
    "prayer": "St. John Neumann, apostle of education, help us build schools and teach the faith effectively.",
    "favors": "Help with education, perseverance, and missionary zeal",
    "categories": ["Studies"]
  },
  {
    "name": "St. John of Damascus",
    "title": "Doctor of the Church",
    "description": "A Syrian monk and theologian who defended the veneration of icons against the iconoclastic emperors. Living under Muslim rule, he was free from Byzantine imperial pressure and wrote influential theological works. His 'Exposition of the Orthodox Faith' systematized Greek theological thought, and his defense of images helped preserve this tradition in Christianity. He also wrote hymns and poetry that enriched Eastern liturgy. His synthesis of patristic theology earned him the title 'Doctor of the Church.'",
    "feastDay": "December 4",
    "born": "676",
    "died": "749",
    "patronOf": "Iconographers, theologians, the Middle East",
    "prayer": "St. John of Damascus, defender of truth, help us appreciate sacred images and defend the faith.",
    "favors": "Help with defense of faith, wisdom, and prayer",
    "categories": ["Studies"]
  },
  {
    "name": "St. John of God",
    "title": "Patron of Hospitals",
    "description": "A Portuguese-born soldier who converted and dedicated his life to caring for the sick and poor in Granada, Spain. After a wild youth, he experienced conversion and began caring for the sick in a rented house. He founded the Brothers Hospitallers and revolutionized hospital care by treating patients with dignity and compassion. He personally cared for the mentally ill, prostitutes, and abandoned children. His innovations in healthcare and his heroic charity earned him recognition as patron of hospitals.",
    "feastDay": "March 8",
    "born": "1495",
    "died": "1550",
    "patronOf": "Hospitals, nurses, the sick, firefighters",
    "prayer": "St. John of God, lover of the sick, inspire us to care for those in need with compassion.",
    "favors": "Help with the sick, charity, and care for the poor",
    "categories": ["Healing"]
  },
  {
    "name": "St. John the Apostle",
    "title": "Beloved Disciple",
    "description": "The youngest of the twelve apostles, known as the 'Beloved Disciple' who leaned on Jesus at the Last Supper. He was the only apostle present at the crucifixion, where Jesus entrusted Mary to his care. Tradition attributes the Fourth Gospel, three epistles, and Revelation to him. He lived to old age in Ephesus, where he combated early heresies and emphasized God's love. His writings focus on the divinity of Christ and the commandment to love one another.",
    "feastDay": "December 27",
    "born": "1st century",
    "died": "100 AD",
    "patronOf": "Authors, theologians, friendship, loyalty",
    "prayer": "St. John the Apostle, beloved disciple, help us grow in love and understanding of divine mysteries.",
    "favors": "Help with love, faithfulness, and understanding of divine mysteries",
    "categories": ["Studies", "Family"]
  },
  {
    "name": "St. John Vianney",
    "title": "Curé of Ars",
    "description": "A French parish priest known for his holiness, preaching, and extraordinary gift for reading souls in confession. Despite academic struggles in seminary, he became one of the Church's greatest confessors, spending up to 18 hours daily in the confessional. Pilgrims came from across Europe to seek his counsel. He lived on little food and sleep, practicing severe penances while showing infinite compassion to penitents. His pastoral dedication and mystical gifts transformed his parish and influenced the entire Church.",
    "feastDay": "August 4",
    "born": "1786",
    "died": "1859",
    "patronOf": "Parish priests, confessors, clergy",
    "prayer": "St. John Vianney, holy pastor, help priests serve with dedication and transform hearts through confession.",
    "favors": "Help with priestly vocations, confession, and holiness of life",
    "categories": ["Studies"]
  },
  {
    "name": "St. José Luis Sánchez del Río",
    "title": "Cristero Martyr",
    "description": "A 14-year-old Mexican boy who was martyred during the Cristero War for refusing to renounce his Catholic faith. He joined the Cristero rebels as a flag bearer and was captured after his horse was shot. Despite torture and imprisonment, he refused to apostatize and was executed while shouting 'Viva Cristo Rey!' His courage inspired many during the persecution and made him a symbol of youthful faith and martyrdom.",
    "feastDay": "February 10",
    "born": "1913",
    "died": "1928",
    "patronOf": "Mexican youth, persecuted Christians, courage",
    "prayer": "St. José Luis, young martyr, give courage to youth facing persecution for their faith.",
    "favors": "Help with courage, fidelity, and perseverance in persecution",
    "categories": ["Family", "Protection"]
  },
  {
    "name": "St. Joseph Cupertino",
    "title": "Flying Saint",
    "description": "An Italian Franciscan priest famous for his levitations and ecstasies during prayer. Despite learning difficulties and social awkwardness, he was ordained and experienced extraordinary mystical phenomena. He would levitate during Mass and at the mention of holy names. His supernatural gifts caused disturbances, leading to restrictions on his public appearances. He is invoked by students taking exams because of his own struggles with studies and his miraculous help in passing tests.",
    "feastDay": "September 18",
    "born": "1603",
    "died": "1663",
    "patronOf": "Students, test takers, pilots, astronauts",
    "prayer": "St. Joseph Cupertino, help students overcome difficulties and succeed in their studies through prayer.",
    "favors": "Help with exams, academic success, and spiritual joy",
    "categories": ["Studies"]
  },
  {
    "name": "St. Joseph the Worker",
    "title": "Patron of Workers",
    "description": "This feast honors St. Joseph in his role as a carpenter and worker, emphasizing the dignity of labor and the sanctification of work. Established by Pope Pius XII in 1955 to provide a Christian alternative to communist May Day celebrations, it highlights Joseph's example of providing for his family through honest labor. Joseph represents all workers who support their families and contribute to society through their daily work.",
    "feastDay": "May 1",
    "born": "1st century BC",
    "died": "1st century AD",
    "patronOf": "Workers, laborers, employment, social justice",
    "prayer": "St. Joseph the Worker, help us find dignity in our labor and provide for our families with integrity.",
    "favors": "Help with employment, dignity of labor, and family protection",
    "categories": ["Jobs", "Family"]
  },
  {
    "name": "St. Josephine Bakhita",
    "title": "The Sudanese Saint",
    "description": "A Sudanese woman who was kidnapped into slavery as a child and eventually gained freedom in Italy. She experienced brutal treatment from various masters before being brought to Italy, where she learned about Christianity and was baptized. She became a Canossian sister and spent her life in service, sharing her story to inspire others. Her forgiveness of her captors and her joyful spirit despite suffering made her a powerful witness to God's love and mercy.",
    "feastDay": "February 8",
    "born": "1869",
    "died": "1947",
    "patronOf": "Sudan, human trafficking victims, kidnap victims",
    "prayer": "St. Josephine Bakhita, survivor of slavery, help us forgive our enemies and find freedom in Christ.",
    "favors": "Help with freedom from slavery, healing from trauma, and faithfulness",
    "categories": ["Healing", "Protection"]
  },
  {
    "name": "St. Juan Diego",
    "title": "Visionary of Guadalupe",
    "description": "An indigenous Mexican who received the apparitions of Our Lady of Guadalupe in 1531. A recent convert to Christianity, he was chosen by Mary to request that the bishop build a church on Tepeyac Hill. When the bishop demanded a sign, Mary provided roses in winter and left her image on Juan Diego's tilma. His simple faith and obedience made possible one of the most important Marian apparitions in history, leading to millions of conversions.",
    "feastDay": "December 9",
    "born": "1474",
    "died": "1548",
    "patronOf": "Indigenous peoples, Mexico, converts",
    "prayer": "St. Juan Diego, faithful messenger, help us respond to Mary's call with humility and trust.",
    "favors": "Help with faith, humility, and devotion to Our Lady of Guadalupe",
    "categories": ["Family"]
  },
  {
    "name": "St. Kateri Tekakwitha",
    "title": "Lily of the Mohawks",
    "description": "A 17th-century Algonquian-Mohawk woman who converted to Christianity and lived a life of remarkable holiness. Born to a Christian Algonquian mother and Mohawk father, she was orphaned young and scarred by smallpox. After conversion, she faced persecution from her tribe and fled to a Christian settlement near Montreal. She took a vow of virginity and practiced severe penances, earning the title 'Lily of the Mohawks' for her purity.",
    "feastDay": "July 14",
    "born": "1656",
    "died": "1680",
    "patronOf": "Ecology, exiles, people ridiculed for their faith",
    "prayer": "St. Kateri Tekakwitha, faithful convert, help us remain strong in faith despite opposition.",
    "favors": "Help with purity, healing, and strength in trials",
    "categories": ["Healing", "Family"]
  },
  {
    "name": "St. Katharine Drexel",
    "title": "Apostle to Native and African Americans",
    "description": "An American heiress who inherited a vast fortune and used it to fund missions and schools for African Americans and Native Americans. She founded the Sisters of the Blessed Sacrament and established numerous schools and missions throughout the American South and West. Her Xavier University in New Orleans was the first Catholic university for African Americans. She personally taught and served in her missions, dedicating her life and fortune to racial justice and education.",
    "feastDay": "March 3",
    "born": "1858",
    "died": "1955",
    "patronOf": "Racial justice, philanthropists, Native Americans",
    "prayer": "St. Katharine Drexel, champion of justice, help us work for equality and serve the marginalized.",
    "favors": "Help with missions, racial justice, and charity",
    "categories": ["Studies", "Healing"]
  },
  {
    "name": "St. Louis de Montfort",
    "title": "Apostle of Total Consecration",
    "description": "A French priest known for his devotion to Mary and his method of 'Total Consecration to Jesus through Mary.' His 'True Devotion to the Blessed Virgin' influenced countless Catholics, including St. John Paul II. He preached parish missions throughout France, often facing opposition from Jansenists. He founded the Montfort Missionaries and the Daughters of Wisdom. His Marian spirituality emphasizes complete surrender to Jesus through Mary as the perfect path to holiness.",
    "feastDay": "April 28",
    "born": "1673",
    "died": "1716",
    "patronOf": "Montfort Missionaries, Marian devotion",
    "prayer": "St. Louis de Montfort, apostle of Mary, help us consecrate ourselves totally to Jesus through Mary.",
    "favors": "Help with Marian devotion, purity, and spiritual renewal",
    "categories": ["Family"]
  },
  {
    "name": "St. Louis King of France",
    "title": "The Crusader King",
    "description": "A 13th-century French king renowned for his justice, charity, and devotion to the poor. He led two crusades to the Holy Land and died of plague during the second one in Tunisia. Known for personally judging cases under an oak tree and for his care of lepers and beggars, he balanced royal duties with intense spiritual life. He built Sainte-Chapelle to house the Crown of Thorns and promoted learning and the arts. His reign was considered a golden age of medieval Christian kingship.",
    "feastDay": "August 25",
    "born": "1214",
    "died": "1270",
    "patronOf": "France, crusaders, difficult marriages",
    "prayer": "St. Louis, just king, help leaders serve with integrity and work for justice and peace.",
    "favors": "Help with peace, justice, and leadership",
    "categories": ["Protection"]
  }
]