[
  {
    "name": "St. Luke",
    "title": "Evangelist and Physician",
    "description": "A Greek physician who became a companion of St. Paul and wrote the Gospel of Luke and Acts of the Apostles. His Gospel emphasizes Jesus' compassion for the poor, women, and outcasts. As a physician, he brings medical precision to his descriptions of healings. His accounts of the early Church in Acts provide crucial historical information about Christianity's spread. His combination of medical knowledge and theological insight makes him patron of physicians and artists.",
    "feastDay": "October 18",
    "born": "1st century",
    "died": "84 AD",
    "patronOf": "Physicians, surgeons, artists, painters",
    "prayer": "St. Luke, beloved physician, guide healers and artists in their service to God and humanity.",
    "favors": "Help with healing, physicians, and artistic inspiration",
    "categories": ["Healing", "Studies"]
  },
  {
    "name": "St. Lydwine",
    "title": "Victim Soul",
    "description": "A Dutch mystic who suffered from a mysterious illness for 38 years, offering her pain for the conversion of sinners. Her suffering began at age 16 with a skating accident and progressively worsened, but she accepted it as participation in Christ's passion. She experienced mystical visions and was sustained by the Eucharist alone for long periods. Her patient endurance and spiritual insights attracted pilgrims seeking guidance. She represents the redemptive value of suffering united to Christ.",
    "feastDay": "April 14",
    "born": "1380",
    "died": "1433",
    "patronOf": "Chronic illness, ice skaters, those suffering",
    "prayer": "St. Lydwine, patient sufferer, help us find meaning in our pain and unite it to Christ's passion.",
    "favors": "Help with patience in suffering, healing, and perseverance",
    "categories": ["Healing"]
  },
  {
    "name": "St. Margaret of Castello",
    "title": "Little Dove",
    "description": "An Italian Dominican tertiary who was born blind, lame, and with severe physical deformities. Abandoned by her parents at a shrine, she was cared for by the townspeople of Castello. Despite her disabilities, she lived a life of prayer, penance, and service to others. She was known for her wisdom, joy, and mystical experiences. Her holiness and miracles led to immediate veneration after death. She shows that physical limitations cannot prevent spiritual greatness.",
    "feastDay": "April 13",
    "born": "1287",
    "died": "1320",
    "patronOf": "Disabled people, unwanted children, mental illness",
    "prayer": "St. Margaret of Castello, little dove, help us see God's love in every person regardless of their limitations.",
    "favors": "Help with overcoming disabilities, faith, and charity",
    "categories": ["Healing"]
  },
  {
    "name": "St. Margaret of Cortona",
    "title": "Second Magdalene",
    "description": "An Italian Franciscan tertiary who lived a sinful life before experiencing dramatic conversion. After her lover's murder, she publicly confessed her sins and dedicated herself to penance and caring for the poor. She experienced mystical visions and founded a hospital for the poor. Her radical conversion from public sinner to public saint earned her the title 'Second Magdalene.' She represents the transforming power of God's mercy and the possibility of redemption for all.",
    "feastDay": "May 16",
    "born": "1247",
    "died": "1297",
    "patronOf": "Prostitutes, single mothers, homeless people",
    "prayer": "St. Margaret of Cortona, penitent saint, help us turn from sin and serve the poor with love.",
    "favors": "Help with repentance, conversion, and assistance for the poor",
    "categories": ["Healing"]
  },
  {
    "name": "St. Margaret of Scotland",
    "title": "Queen and Reformer",
    "description": "An English princess who became Queen of Scotland and transformed the Scottish Church and society. She promoted education, reformed religious practices, and cared for orphans and the poor. She established hostels for pilgrims and ransomed captives. Her influence helped civilize the rough Scottish court and strengthen the Church in Scotland. She balanced royal duties with intense prayer life and charitable works, dying shortly after learning of her husband's death in battle.",
    "feastDay": "November 16",
    "born": "1045",
    "died": "1093",
    "patronOf": "Scotland, queens, large families, learning",
    "prayer": "St. Margaret of Scotland, holy queen, help us use our positions to serve God and help others.",
    "favors": "Help with charity, peace in family, and Christian leadership",
    "categories": ["Family", "Studies"]
  },
  {
    "name": "St. Mark Xi Tianxiang",
    "title": "Chinese Martyr",
    "description": "A Chinese catechist who struggled with opium addiction but remained faithful to the Church despite his weakness. He continued to serve as a catechist even while battling his addiction, showing remarkable humility and perseverance. During the Boxer Rebellion, he was captured and tortured for his faith but refused to apostatize. He was executed along with other Chinese martyrs, achieving in death the victory over sin he had struggled for in life.",
    "feastDay": "July 9",
    "born": "1851",
    "died": "1900",
    "patronOf": "Drug addicts, those struggling with addiction",
    "prayer": "St. Mark Xi Tianxiang, faithful despite weakness, help those struggling with addiction find strength in faith.",
    "favors": "Help with perseverance in faith and forgiveness",
    "categories": ["Healing"]
  },
  {
    "name": "St. Mary MacKillop",
    "title": "Mother of Australia",
    "description": "An Australian nun who co-founded the Sisters of St. Joseph and established Catholic schools throughout Australia. She faced opposition from some clergy and was temporarily excommunicated due to conflicts over her order's independence. She persevered and was vindicated, continuing her educational work among the poor. She founded schools in remote areas and advocated for the rights of women and children. She became the first Australian saint, representing the Church's mission to the marginalized.",
    "feastDay": "August 8",
    "born": "1842",
    "died": "1909",
    "patronOf": "Australia, teachers, sexual abuse victims",
    "prayer": "St. Mary MacKillop, mother of Australia, help us educate children and protect the vulnerable.",
    "favors": "Help with education, perseverance, and care for the poor",
    "categories": ["Studies", "Protection"]
  },
  {
    "name": "St. Mary Magdalene",
    "title": "Apostle to the Apostles",
    "description": "A follower of Jesus who was present at his crucifixion and was the first to witness his resurrection. Tradition identifies her as the sinful woman who anointed Jesus' feet, though this is debated. She proclaimed the resurrection to the apostles, earning the title 'Apostle to the Apostles.' In the East, she is honored as equal to the apostles. Her story represents the power of Christ's forgiveness and the important role of women in early Christianity.",
    "feastDay": "July 22",
    "born": "1st century",
    "died": "1st century",
    "patronOf": "Penitent women, perfumers, hairdressers",
    "prayer": "St. Mary Magdalene, faithful witness, help us proclaim the resurrection with joy and conviction.",
    "favors": "Help with repentance, conversion, and faithful devotion",
    "categories": ["Family"]
  },
  {
    "name": "St. Matthew",
    "title": "Evangelist and Apostle",
    "description": "A tax collector who left everything to follow Jesus and became one of the twelve apostles. His Gospel emphasizes Jesus as the fulfillment of Old Testament prophecies and is structured to appeal to Jewish readers. As a tax collector, he was despised by his fellow Jews but experienced radical conversion through Jesus' call. His Gospel contains the Sermon on the Mount and emphasizes Jesus as teacher and king. He represents the possibility of conversion for even the most despised sinners.",
    "feastDay": "September 21",
    "born": "1st century",
    "died": "1st century",
    "patronOf": "Accountants, tax collectors, customs officers",
    "prayer": "St. Matthew, converted apostle, help us leave our old ways behind and follow Christ completely.",
    "favors": "Help with conversion, honesty, and evangelization",
    "categories": ["Studies"]
  },
  {
    "name": "St. Nicholas of Myra",
    "title": "Saint Nicholas",
    "description": "A 4th-century bishop known for his generosity and care for children and the poor. He secretly provided dowries for three poor sisters and rescued sailors from storms. Many legends surround his miraculous interventions, including raising children from the dead. His generous gift-giving inspired the Santa Claus tradition. He attended the Council of Nicaea and defended orthodox Christianity against Arianism. His combination of pastoral care and doctrinal firmness made him one of the most beloved saints.",
    "feastDay": "December 6",
    "born": "270",
    "died": "343",
    "patronOf": "Children, sailors, merchants, Russia",
    "prayer": "St. Nicholas, generous bishop, inspire us to give generously and protect the innocent.",
    "favors": "Help with generosity, protection of children, and travelers",
    "categories": ["Family", "Journey Mercy"]
  },
  {
    "name": "St. Patrick of Ireland",
    "title": "Apostle of Ireland",
    "description": "A British-born missionary who evangelized Ireland in the 5th century. Captured as a slave in his youth, he escaped but returned as a bishop to convert his former captors. He used the shamrock to explain the Trinity and established monasteries and churches throughout Ireland. His 'Confession' reveals his deep humility and trust in God's grace. He transformed Ireland from a pagan to a Christian land, leading to its golden age of learning and missionary activity.",
    "feastDay": "March 17",
    "born": "385",
    "died": "461",
    "patronOf": "Ireland, engineers, against snakes",
    "prayer": "St. Patrick, apostle of Ireland, help us share the Gospel and overcome all obstacles to faith.",
    "favors": "Help with evangelization, protection, and overcoming evil",
    "categories": ["Protection"]
  },
  {
    "name": "St. Paul of the Cross",
    "title": "Founder of Passionists",
    "description": "An Italian priest who founded the Passionist Congregation dedicated to preaching Christ's passion. He experienced mystical visions and emphasized devotion to the sufferings of Christ. His preaching missions brought many conversions and renewed faith throughout Italy. He practiced severe penances and lived in extreme poverty. His spirituality centered on finding God through meditation on Christ's passion and using suffering as a means of spiritual growth.",
    "feastDay": "October 19",
    "born": "1694",
    "died": "1775",
    "patronOf": "Passionists, those who suffer",
    "prayer": "St. Paul of the Cross, lover of Christ's passion, help us find meaning in suffering and preach with zeal.",
    "favors": "Help with Passion devotion, perseverance, and missionary zeal",
    "categories": ["Studies"]
  },
  {
    "name": "St. Pedro Calungsod",
    "title": "Young Filipino Martyr",
    "description": "A Filipino teenager who accompanied Spanish missionaries to the Mariana Islands and was martyred while evangelizing the Chamorro people. He served as a catechist and was known for his purity, devotion, and zeal for souls. When tensions arose between the missionaries and locals, he was killed along with the priest he served. His youthful courage and dedication to the mission made him a model for young people and missionaries.",
    "feastDay": "April 2",
    "born": "1654",
    "died": "1672",
    "patronOf": "Filipino youth, catechists, missionaries",
    "prayer": "St. Pedro Calungsod, young missionary, inspire youth to serve God with courage and dedication.",
    "favors": "Help with courage in faith, missionary work, and youth guidance",
    "categories": ["Studies", "Family"]
  },
  {
    "name": "St. Peter Chanel",
    "title": "Martyr of Oceania",
    "description": "A French Marist priest who was the first martyr of Oceania, killed while evangelizing the island of Futuna. Despite initial difficulties with the language and culture, he gradually won converts through his kindness and care for the sick. When the chief's son converted, the chief ordered Peter's death. His martyrdom led to the conversion of the entire island within two years. He represents the missionary spirit and the power of sacrificial love in evangelization.",
    "feastDay": "April 28",
    "born": "1803",
    "died": "1841",
    "patronOf": "Oceania, Marist Fathers, difficult missions",
    "prayer": "St. Peter Chanel, martyr missionary, give courage to those who preach the Gospel in difficult places.",
    "favors": "Help with missionary zeal, courage, and protection",
    "categories": ["Protection"]
  },
  {
    "name": "St. Peter Julian Eymard",
    "title": "Apostle of the Eucharist",
    "description": "A French priest who founded two religious congregations dedicated to Eucharistic adoration: the Blessed Sacrament Fathers and the Servants of the Blessed Sacrament. He promoted frequent communion and Eucharistic adoration when these practices were rare. His devotion to the Eucharist was sparked by a profound spiritual experience before the Blessed Sacrament. He established the practice of perpetual adoration and wrote extensively on Eucharistic spirituality.",
    "feastDay": "August 2",
    "born": "1811",
    "died": "1868",
    "patronOf": "Eucharistic associations, First Communicants",
    "prayer": "St. Peter Julian Eymard, apostle of the Eucharist, deepen our love for Jesus in the Blessed Sacrament.",
    "favors": "Help with Eucharistic devotion, faith, and spiritual nourishment",
    "categories": ["Family"]
  }
]