[
  {
    "name": "St. Isidore the Farmer",
    "title": "Patron of Farmers",
    "description": "A Spanish farmworker who lived a life of prayer while working the fields around Madrid. Known for his devotion to Mass, charity to the poor, and miraculous events during his farming work. Angels were reportedly seen helping him plow when he stopped work to pray. He shared his meager meals with beggars and even fed wild animals. His simple life of work and prayer shows how ordinary labor can become a path to holiness when done with love for God.",
    "feastDay": "May 15",
    "born": "1070",
    "died": "1130",
    "patronOf": "Farmers, rural communities, Madrid, agricultural workers",
    "prayer": "St. Isidore the Farmer, bless our work and help us find God in daily labor and care for creation.",
    "favors": "Good harvests, help with farming and agriculture, intercession for the working poor, and favorable weather",
    "categories": ["Jobs"]
  },
  {
    "name": "St. Odilia",
    "title": "Patron of the Blind",
    "description": "Born blind to a noble Alsatian family, Odilia was rejected by her father and raised in a convent. When baptized, she miraculously received her sight. She later founded several convents and became abbess of Hohenburg. Known for her charity to the poor and pilgrims, she established hospitals and hostels. Her shrine in Alsace became a place of pilgrimage for those with eye problems, and many miraculous cures have been attributed to her intercession.",
    "feastDay": "December 13",
    "born": "660",
    "died": "720",
    "patronOf": "Blind people, eye diseases, Alsace",
    "prayer": "St. Odilia, patron of the blind, open our spiritual eyes and heal those with vision problems.",
    "favors": "Healing of vision problems and other ailments, with many miraculous cures",
    "categories": ["Healing"]
  },
  {
    "name": "St. Vincent de Paul",
    "title": "Apostle of Charity",
    "description": "A French priest who dedicated his life to serving the poor and organizing charitable works. He founded the Congregation of the Mission (Vincentians) and co-founded the Daughters of Charity with St. Louise de Marillac. His innovative approach to helping the poor included organized relief efforts, hospitals, orphanages, and seminaries. He reformed seminary education and sent missionaries worldwide. His motto 'The poor are our masters' reflects his revolutionary approach to charity.",
    "feastDay": "September 27",
    "born": "1581",
    "died": "1660",
    "patronOf": "Charitable societies, hospitals, prisoners, volunteers",
    "prayer": "St. Vincent de Paul, father of the poor, inspire us to serve Christ in those most in need.",
    "favors": "Works of charity, help with poverty, and guidance for ministries of service",
    "categories": ["Healing"]
  },
  {
    "name": "St. Guardian Angel",
    "title": "Heavenly Protector",
    "description": "Catholic teaching holds that God assigns a guardian angel to every person at birth to guide, protect, and intercede for them throughout life. These celestial beings help souls avoid spiritual and physical dangers, inspire good thoughts, and present prayers to God. The devotion to guardian angels encourages daily communication with these heavenly protectors, seeking their guidance in decisions and protection from harm. They serve as constant companions on the journey to heaven.",
    "feastDay": "October 2",
    "born": "Before creation",
    "died": "Eternal",
    "patronOf": "Children, travelers, those in danger",
    "prayer": "Angel of God, my guardian dear, to whom God's love commits me here, ever this day be at my side, to light and guard, to rule and guide.",
    "favors": "Guidance in decisions, protection from danger, spiritual companionship, and help with anxiety or fear",
    "categories": ["Protection"]
  },
  {
    "name": "St. Blaise",
    "title": "Bishop and Martyr",
    "description": "A physician who became Bishop of Sebastea in Armenia and was martyred during Diocletian's persecution. According to legend, wild animals would come to him for healing, and he lived as a hermit in a cave. He was arrested while praying and tortured with iron combs used for carding wool. The blessing of throats on his feast day stems from the tradition that he saved a child from choking on a fishbone. His medical background made him patron of throat ailments.",
    "feastDay": "February 3",
    "born": "3rd century",
    "died": "316",
    "patronOf": "Throat ailments, veterinarians, wool workers",
    "prayer": "St. Blaise, holy bishop and martyr, protect us from throat ailments and all illness.",
    "favors": "Protection from throat ailments and illnesses, healing, and blessing",
    "categories": ["Healing"]
  },
  {
    "name": "St. Expeditus",
    "title": "Saint of Urgent Causes",
    "description": "A Roman centurion who converted to Christianity and was martyred for his faith. His name, meaning 'quick' or 'expeditious,' led to his invocation for urgent needs and quick solutions. Popular especially in Latin America and parts of Europe, he is called upon when immediate help is needed. Devotees often promise to spread devotion to him in exchange for favors. His cult emphasizes swift action and decisive faith in times of crisis.",
    "feastDay": "April 19",
    "born": "3rd century",
    "died": "303",
    "patronOf": "Urgent causes, emergencies, quick solutions",
    "prayer": "St. Expeditus, helper in urgent needs, intercede for us in our pressing difficulties.",
    "favors": "Urgent help, quick solutions to problems, and courage in action",
    "categories": ["Impossible Causes"]
  },
  {
    "name": "St. Dymphna",
    "title": "Patron of Mental Health",
    "description": "An Irish princess whose pagan father wanted to marry her after her Christian mother's death. She fled to Belgium with her confessor, where her father found and beheaded both. Her shrine in Geel, Belgium, became famous for healing mental illness, and the town developed a unique tradition of caring for the mentally ill in family homes. She represents hope for those struggling with mental health issues and their families.",
    "feastDay": "May 15",
    "born": "7th century",
    "died": "620",
    "patronOf": "Mental illness, anxiety, depression, family harmony",
    "prayer": "St. Dymphna, patroness of mental health, bring healing to troubled minds and peace to anxious hearts.",
    "favors": "Healing of mental illness, help with anxiety, and courage",
    "categories": ["Healing"]
  },
  {
    "name": "St. Peregrine",
    "title": "Patron of Cancer Patients",
    "description": "An Italian Servite friar who experienced a miraculous healing from cancer in his leg the night before it was to be amputated. He had been a political opponent of the Church in his youth but converted after an encounter with St. Philip Benizi. He became a priest and was known for his preaching and austere life. His cancer cure made him the patron of cancer patients, and many miraculous healings have been attributed to his intercession.",
    "feastDay": "May 1",
    "born": "1260",
    "died": "1345",
    "patronOf": "Cancer patients, AIDS patients, serious illnesses",
    "prayer": "St. Peregrine, you who were healed of cancer, intercede for all who suffer from serious illness.",
    "favors": "Help with healing, especially cancer and serious illness",
    "categories": ["Healing"]
  },
  {
    "name": "St. Philomena",
    "title": "Wonder Worker",
    "description": "According to tradition revealed through mystical communications, Philomena was a Greek princess martyred at age 13 for refusing to marry Emperor Diocletian and maintaining her vow of virginity to Christ. Her relics were discovered in the Roman catacombs in 1802, and numerous miracles followed. Though her historical existence is debated, her cult spread rapidly in the 19th century, with many saints including the Curé of Ars promoting devotion to her.",
    "feastDay": "August 11",
    "born": "3rd century",
    "died": "304",
    "patronOf": "Youth, purity, miracles",
    "prayer": "St. Philomena, powerful wonder worker, intercede for us in our needs and help us remain pure.",
    "favors": "Help with healing, miracles, and protection in times of trial",
    "categories": ["Healing", "Family"]
  },
  {
    "name": "St. Raphael the Archangel",
    "title": "God's Healer",
    "description": "One of the three archangels named in Scripture, Raphael appears in the Book of Tobit as the guide and healer. He accompanied young Tobias on his journey, helped him find a wife, and healed Tobit's blindness. His name means 'God heals,' and he is traditionally invoked for healing, safe travel, and protection. As patron of travelers and the sick, he represents God's providence and care for those on life's journey.",
    "feastDay": "September 29",
    "born": "Before creation",
    "died": "Eternal",
    "patronOf": "Travelers, the blind, physicians, young people",
    "prayer": "St. Raphael the Archangel, guide us safely on our earthly journey and bring God's healing to the sick.",
    "favors": "Help with healing, guidance on journeys, and protection",
    "categories": ["Healing", "Journey Mercy"]
  },
  {
    "name": "St. Camillus de Lellis",
    "title": "Patron of Hospitals",
    "description": "A former soldier and gambler who converted and dedicated his life to caring for the sick. He founded the Ministers of the Sick (Camillians) and revolutionized hospital care, introducing hygiene standards and compassionate treatment. He established the first field ambulance service and trained nurses in proper patient care. His order pioneered many modern healthcare practices, and he is considered a father of modern nursing alongside compassionate spiritual care.",
    "feastDay": "July 14",
    "born": "1550",
    "died": "1614",
    "patronOf": "Hospitals, nurses, the sick, health care workers",
    "prayer": "St. Camillus de Lellis, patron of the sick, inspire healthcare workers with your compassion and dedication.",
    "favors": "Help with cases of illness, healing, care for the sick, health professionals, and hospitals",
    "categories": ["Healing"]
  },
  {
    "name": "St. Agatha",
    "title": "Virgin and Martyr",
    "description": "A Sicilian virgin who refused the advances of a Roman prefect and was tortured for her faith. Her breasts were cut off during torture, but she was healed by St. Peter in a vision. She was later rolled over hot coals and broken pottery. She is invoked against fire and volcanic eruptions, particularly Mount Etna in Sicily. Her courage in maintaining her purity and faith despite horrific torture makes her a powerful intercessor for those facing trials.",
    "feastDay": "February 5",
    "born": "231",
    "died": "251",
    "patronOf": "Breast cancer patients, fire protection, volcanic eruptions",
    "prayer": "St. Agatha, courageous virgin and martyr, protect us from fire and strengthen us in purity.",
    "favors": "Help with protection from fire, healing of breast ailments, and strength in suffering and purity",
    "categories": ["Healing"]
  },
  {
    "name": "St. Anastasia",
    "title": "Deliverer from Potions",
    "description": "A Roman martyr known for her care of Christian prisoners and martyrs during Diocletian's persecution. She was married to a pagan but secretly helped imprisoned Christians, bringing them food and comfort. After her husband's death, she was arrested and tortured. She is traditionally invoked against poisoning and for protection from harmful substances. Her feast day is celebrated on Christmas Day in the Byzantine tradition, reflecting her importance in Eastern Christianity.",
    "feastDay": "December 25",
    "born": "3rd century",
    "died": "304",
    "patronOf": "Protection from poisons, weavers, martyrs",
    "prayer": "St. Anastasia, deliverer from potions, protect us from all harmful substances and spiritual poisons.",
    "favors": "Help with deliverance from poisons, exorcisms, and strength in faith and perseverance during trials",
    "categories": ["Protection", "Healing"]
  },
  {
    "name": "St. Peter Claver",
    "title": "Apostle of the Slaves",
    "description": "A Spanish Jesuit who ministered to enslaved Africans in Cartagena, Colombia for nearly forty years. He met every slave ship, providing food, medicine, and catechesis to the captives. He baptized over 300,000 people and cared for slaves in horrific conditions with heroic charity. His motto was 'slave of the slaves forever.' He challenged the institution of slavery through his actions, showing the equal dignity of all people before God.",
    "feastDay": "September 9",
    "born": "1580",
    "died": "1654",
    "patronOf": "Slaves, African Americans, race relations, Colombia",
    "prayer": "St. Peter Claver, apostle of the oppressed, help us work for justice and treat all people with dignity.",
    "favors": "Help with racial harmony, compassion for the marginalized, and help in social justice missions",
    "categories": ["Healing"]
  },
  {
    "name": "Holy Souls in Purgatory",
    "title": "Suffering Souls",
    "description": "Catholic doctrine teaches that souls who die in God's grace but with venial sins or temporal punishment undergo purification before entering heaven. These souls cannot pray for themselves but can be helped by the prayers, masses, and good works of the living. In return, they become powerful intercessors once in heaven. Devotion to the Holy Souls emphasizes the communion of saints and our obligation to help those who have gone before us.",
    "feastDay": "November 2",
    "born": "Various times",
    "died": "Various times",
    "patronOf": "Those in purgatory, the dying, bereaved families",
    "prayer": "Eternal rest grant unto them, O Lord, and let perpetual light shine upon them. May they rest in peace.",
    "favors": "Release from purification, and powerful intercession for the living once in Heaven",
    "categories": ["Family"]
  },
  {
    "name": "Sacred Heart of Jesus",
    "title": "Divine Heart of Love",
    "description": "This devotion honors the physical heart of Jesus as the symbol of his divine love for humanity. Promoted especially by St. Margaret Mary Alacoque's visions, it emphasizes Jesus' love, mercy, and desire for reparation. The Sacred Heart represents God's infinite love and the wounds inflicted by human sin and ingratitude. The devotion includes the First Friday practices, consecration prayers, and the Litany of the Sacred Heart, focusing on love and reparation.",
    "feastDay": "Friday after Corpus Christi",
    "born": "Eternal devotion",
    "died": "Eternal",
    "patronOf": "Universal love, mercy, reparation",
    "prayer": "Sacred Heart of Jesus, I place all my trust in You. Have mercy on us and on the whole world.",
    "favors": "Help with love, mercy, healing, and conversion",
    "categories": ["Family", "Healing"]
  }
]