[
  {
    "name": "St. Francis de Sales",
    "title": "Doctor of the Church, Gentleman Saint",
    "description": "A French bishop known for his gentle approach to spiritual direction and his writings on lay spirituality. He reconverted many Calvinists in the Chablais region through patient dialogue and clear teaching. His 'Introduction to the Devout Life' showed laypeople how to pursue holiness in ordinary circumstances. He co-founded the Visitation Order with St. Jane Frances de Chantal. His kindness, patience, and optimistic spirituality earned him the title 'Gentleman Saint.'",
    "feastDay": "January 24",
    "born": "1567",
    "died": "1622",
    "patronOf": "Writers, journalists, the deaf",
    "prayer": "St. Francis de Sales, gentle teacher, help us communicate with patience and grow in holiness.",
    "favors": "Help with communication, patience, and spiritual growth",
    "categories": ["Studies"]
  },
  {
    "name": "St. Francis Xavier",
    "title": "Apostle of the Indies",
    "description": "A Spanish Jesuit missionary who evangelized in India, Indonesia, and Japan. One of the original companions of St. Ignatius Loyola, he traveled thousands of miles bringing the Gospel to Asia. He baptized hundreds of thousands and established Christian communities across the Far East. He died while attempting to enter China. His missionary zeal and effectiveness made him patron of foreign missions and a model for all evangelizers.",
    "feastDay": "December 3",
    "born": "1506",
    "died": "1552",
    "patronOf": "Foreign missions, navigators, Japan",
    "prayer": "St. Francis Xavier, zealous missionary, inspire us to spread the Gospel to all nations.",
    "favors": "Courage in missions, aid in conversion, and help with travel",
    "categories": ["Journey Mercy"]
  },
  {
    "name": "St. Gabriel of Our Lady of Sorrows",
    "title": "Passionist Saint",
    "description": "An Italian Passionist student who died at age 24 after living a life of extraordinary devotion and penance. Born into a wealthy family, he initially lived a worldly life before a serious illness led to his conversion. He joined the Passionists and was known for his devotion to the Sorrowful Mother and his heroic penances. His youthful holiness and devotion to Mary's sorrows made him a beloved saint among the young.",
    "feastDay": "February 27",
    "born": "1838",
    "died": "1862",
    "patronOf": "Students, young people, Passionists",
    "prayer": "St. Gabriel, devoted to Mary's sorrows, help us embrace suffering with faith and love.",
    "favors": "Strength in suffering, help with faithfulness, and courage in trials",
    "categories": ["Studies", "Family"]
  },
  {
    "name": "St. Gabriel the Archangel",
    "title": "Messenger of God",
    "description": "One of the three archangels named in Scripture, Gabriel serves as God's herald for the most important announcements. He appeared to Daniel, Zechariah, and most famously to Mary at the Annunciation. His name means 'God is my strength,' and he brings messages of comfort and divine intervention. As God's messenger, he represents divine communication and the power of God's word to transform lives.",
    "feastDay": "September 29",
    "born": "Before creation",
    "died": "Eternal",
    "patronOf": "Messengers, postal workers, broadcasters",
    "prayer": "St. Gabriel the Archangel, God's messenger, help us hear and respond to God's call in our lives.",
    "favors": "Protection, guidance, and help with communication of God's messages",
    "categories": ["Protection"]
  },
  {
    "name": "St. Genevieve",
    "title": "Patroness of Paris",
    "description": "A French virgin who devoted her life to prayer and charity and is credited with saving Paris from Attila the Hun through her prayers and fasting. She convinced the people not to flee but to pray, and the Huns bypassed the city. She organized relief during a famine and was known for her prophecies and miracles. Her tomb became a pilgrimage site, and she is invoked during disasters threatening Paris.",
    "feastDay": "January 3",
    "born": "419",
    "died": "512",
    "patronOf": "Paris, disasters, fever",
    "prayer": "St. Genevieve, protector of cities, help us trust in God's protection during times of danger.",
    "favors": "Protection of Paris, help in difficulties, and courage",
    "categories": ["Protection"]
  },
  {
    "name": "St. Gerard Majella",
    "title": "Patron of Motherhood",
    "description": "An Italian Redemptorist brother known for his mystical gifts and miraculous interventions, especially in childbirth. Despite his humble origins as a tailor's apprentice, he showed extraordinary holiness from youth. He experienced visions, bilocation, and other mystical phenomena. He is particularly invoked by expectant mothers after several miraculous interventions during difficult births. His deep prayer life and charity made him beloved among the poor.",
    "feastDay": "October 16",
    "born": "1726",
    "died": "1755",
    "patronOf": "Expectant mothers, childbirth, children",
    "prayer": "St. Gerard Majella, protector of mothers, watch over pregnant women and their children.",
    "favors": "Help with difficult pregnancies, protection of children, and healing",
    "categories": ["Family", "Healing"]
  },
  {
    "name": "St. Germaine Cousin",
    "title": "Little Saint of Pibrac",
    "description": "A French peasant girl who suffered from scrofula and was mistreated by her stepmother. Forced to sleep in the stable and tend sheep, she found solace in prayer and the Eucharist. She shared her meager food with beggars and was known for miraculous events, including flowers blooming out of season. Her patient endurance of suffering and charity to those even poorer than herself led to her veneration immediately after death.",
    "feastDay": "June 15",
    "born": "1579",
    "died": "1601",
    "patronOf": "Disabled people, abuse victims, shepherdesses",
    "prayer": "St. Germaine Cousin, patient sufferer, help us find God in our trials and serve others in need.",
    "favors": "Help with poverty, courage in suffering, and faith",
    "categories": ["Healing"]
  },
  {
    "name": "St. Giuseppe Moscati",
    "title": "Holy Physician",
    "description": "An Italian physician who combined medical practice with deep faith and charity. He treated poor patients for free and saw his medical work as a vocation to serve Christ in the sick. Known for his diagnostic skills and compassionate care, he refused payment from the poor and often gave them money for medicine. He remained a layman throughout his life, integrating prayer with scientific medicine.",
    "feastDay": "November 16",
    "born": "1880",
    "died": "1927",
    "patronOf": "Physicians, medical workers, bachelors",
    "prayer": "St. Giuseppe Moscati, holy doctor, guide medical workers and help us see Christ in the sick.",
    "favors": "Healing, help for the sick, and guidance in medical work",
    "categories": ["Healing"]
  },
  {
    "name": "St. Gregory the Great",
    "title": "Doctor of the Church, Pope",
    "description": "A Roman pope who strengthened the Church during turbulent times and laid foundations for medieval Christendom. He reformed liturgy (Gregorian chant bears his name), sent missionaries to England, and wrote influential spiritual works. Despite preferring monastic life, he served as pope for 14 years, dealing with barbarian invasions, plague, and famine. His pastoral letters and homilies show deep spiritual insight combined with practical wisdom.",
    "feastDay": "September 3",
    "born": "540",
    "died": "604",
    "patronOf": "Musicians, teachers, popes",
    "prayer": "St. Gregory the Great, wise shepherd, help leaders serve with humility and wisdom.",
    "favors": "Help with leadership, wisdom, and courage in faith",
    "categories": ["Studies"]
  },
  {
    "name": "St. Helena",
    "title": "Finder of the True Cross",
    "description": "The mother of Emperor Constantine who, according to tradition, discovered the True Cross of Christ in Jerusalem. After her son's conversion made Christianity legal, she made a pilgrimage to the Holy Land at age 80. She built churches at Bethlehem and on the Mount of Olives and founded numerous charitable institutions. Her archaeological work and church building helped establish Christian presence in the Holy Land.",
    "feastDay": "August 18",
    "born": "250",
    "died": "330",
    "patronOf": "Archaeologists, converts, difficult marriages",
    "prayer": "St. Helena, seeker of truth, help us find the true cross in our lives and serve others generously.",
    "favors": "Help in finding holy relics, courage, and faith",
    "categories": ["Studies"]
  },
  {
    "name": "St. Ignatius Loyola",
    "title": "Founder of the Jesuits",
    "description": "A Spanish soldier who founded the Society of Jesus after a conversion experience during recovery from war wounds. His 'Spiritual Exercises' became one of the most influential works of Christian spirituality. He emphasized finding God in all things and sent his followers as missionaries worldwide. The Jesuits became leaders in education, missions, and intellectual defense of the faith. His military background influenced his organized approach to spiritual combat.",
    "feastDay": "July 31",
    "born": "1491",
    "died": "1556",
    "patronOf": "Jesuits, soldiers, spiritual exercises",
    "prayer": "St. Ignatius Loyola, spiritual warrior, help us discern God's will and serve with greater glory.",
    "favors": "Help with spiritual exercises, courage, and guidance in discernment",
    "categories": ["Studies"]
  },
  {
    "name": "St. Isidore of Seville",
    "title": "Doctor of the Church",
    "description": "A Spanish bishop and scholar whose encyclopedic writings preserved classical learning for the Middle Ages. His 'Etymologies' was a standard reference work for centuries, covering everything from theology to natural history. He organized Church councils, promoted education, and helped convert the Visigoths from Arianism. His systematic approach to knowledge and his role in preserving learning during the transition from antiquity to medieval times earned him recognition as patron of the internet.",
    "feastDay": "April 4",
    "born": "560",
    "died": "636",
    "patronOf": "Internet, computer users, students",
    "prayer": "St. Isidore of Seville, keeper of knowledge, help us use learning and technology wisely.",
    "favors": "Help with learning, wisdom, and faithfulness",
    "categories": ["Studies"]
  },
  {
    "name": "St. James the Greater",
    "title": "Son of Thunder, Apostle",
    "description": "One of the twelve apostles and part of Jesus' inner circle with Peter and John. He witnessed the Transfiguration and the Agony in the Garden. The first apostle to be martyred, he was beheaded by Herod Agrippa around 44 AD. According to Spanish tradition, his body was transported to Santiago de Compostela, which became one of Christianity's greatest pilgrimage destinations. His feast day marks the famous Camino de Santiago pilgrimage route.",
    "feastDay": "July 25",
    "born": "1st century",
    "died": "44 AD",
    "patronOf": "Spain, pilgrims, knights",
    "prayer": "St. James the Greater, faithful apostle, give us courage to follow Christ and persevere in faith.",
    "favors": "Courage in faith, help with pilgrimages, and perseverance",
    "categories": ["Journey Mercy"]
  },
  {
    "name": "St. Jane Frances de Chantal",
    "title": "Co-founder of the Visitation Order",
    "description": "A French baroness who became a nun and founded the Visitation Order with St. Francis de Sales. After her husband's death, she raised four children while growing in holiness under Francis de Sales' direction. Her order was designed for women who couldn't handle the physical rigors of other communities but desired religious life. She balanced mystical prayer with practical administration, founding numerous convents throughout France.",
    "feastDay": "August 18",
    "born": "1572",
    "died": "1641",
    "patronOf": "Widows, parents separated from children",
    "prayer": "St. Jane Frances de Chantal, faithful widow, help us persevere in prayer and family duties.",
    "favors": "Help with family life, patience, and perseverance in prayer",
    "categories": ["Family"]
  },
  {
    "name": "St. John Baptist",
    "title": "The Forerunner",
    "description": "The precursor of Jesus who prepared the way for Christ's ministry through preaching repentance and baptizing in the Jordan River. Born to Elizabeth and Zechariah in their old age, he lived an ascetic life in the desert. He baptized Jesus and declared him the 'Lamb of God.' He was imprisoned and beheaded by Herod Antipas for criticizing the ruler's immoral marriage. His fearless preaching and martyrdom make him a model for preparing hearts for Christ.",
    "feastDay": "June 24",
    "born": "1st century BC",
    "died": "30 AD",
    "patronOf": "Baptism, converts, tailors",
    "prayer": "St. John the Baptist, voice in the wilderness, help us prepare our hearts for Christ's coming.",
    "favors": "Help with repentance, courage, and preparing for Christ",
    "categories": ["Family"]
  }
]