[
  {
    "name": "St. Sebastian",
    "title": "Martyr and Protector from Plagues",
    "description": "A Roman soldier and secret Christian who served under Emperor Diocletian. When his faith was discovered, he was ordered to be shot with arrows, but miraculously survived. He later confronted the emperor about Christian persecution and was beaten to death. Medieval people invoked him during plague outbreaks, believing his survival of arrows symbolized protection from disease. His courage and recovery made him a powerful intercessor for healing.",
    "feastDay": "January 20",
    "born": "256",
    "died": "288",
    "patronOf": "Soldiers, athletes, plague victims, archers",
    "prayer": "St. Sebastian, martyr and protector, shield us from illness and give us courage in faith.",
    "favors": "Help with protection from contagious diseases and healing from illness",
    "categories": ["Healing", "Protection"]
  },
  {
    "name": "St. Lawrence",
    "title": "Deacon and Martyr",
    "description": "A deacon in Rome under Pope Sixtus II, Lawrence was responsible for the Church's treasury and care of the poor. When ordered to present the Church's treasures to Roman authorities, he gathered the poor, sick, and disabled, declaring them the true treasures. He was martyred by being roasted alive on a gridiron, reportedly joking with his executioners about turning him over. His charity and humor in suffering inspire Christians facing persecution.",
    "feastDay": "August 10",
    "born": "225",
    "died": "258",
    "patronOf": "Deacons, librarians, comedians, cooks, the poor",
    "prayer": "St. Lawrence, faithful deacon, help us serve the poor and face trials with courage and even humor.",
    "favors": "Help with courage in persecution, charity, and assistance to the poor",
    "categories": ["Protection"]
  },
  {
    "name": "St. Stephen",
    "title": "First Martyr",
    "description": "One of the first seven deacons chosen by the apostles, Stephen was known for his wisdom and miraculous works. His powerful preaching about Jesus angered the Jewish authorities who accused him of blasphemy. As he was being stoned to death, he saw heaven opened and Jesus standing at God's right hand. His final prayer for his killers' forgiveness echoed Christ's words on the cross, inspiring future martyrs.",
    "feastDay": "December 26",
    "born": "5 AD",
    "died": "34 AD",
    "patronOf": "Deacons, stonemasons, headaches, casket makers",
    "prayer": "St. Stephen, first martyr, give us strength to witness to Christ and forgive our enemies.",
    "favors": "Help with strength in faith, martyrdom, and forgiveness",
    "categories": ["Protection"]
  },
  {
    "name": "St. Agnes",
    "title": "Virgin and Martyr",
    "description": "A 13-year-old Roman girl who consecrated her virginity to Christ and refused marriage to a pagan nobleman. When threatened with torture and death, she declared that Christ was her only spouse. Various tortures failed to harm her, and she was finally beheaded. Her courage at such a young age and dedication to purity made her a beloved saint, especially venerated by young women seeking to live chaste lives.",
    "feastDay": "January 21",
    "born": "291",
    "died": "304",
    "patronOf": "Young girls, chastity, gardeners, rape victims",
    "prayer": "St. Agnes, pure virgin and martyr, help us remain faithful to Christ in all circumstances.",
    "favors": "Purity, protection of children, and help with faithfulness",
    "categories": ["Family"]
  },
  {
    "name": "St. Polycarp",
    "title": "Bishop and Martyr",
    "description": "A disciple of St. John the Apostle and Bishop of Smyrna, Polycarp was a link between the apostolic age and later Church. At age 86, he was arrested during persecution and given the chance to deny Christ. His famous response was: 'Eighty-six years I have served Him, and He has done me no wrong. How can I blaspheme my King and Savior?' He was burned at the stake, becoming a model of faithful perseverance.",
    "feastDay": "February 23",
    "born": "69",
    "died": "155",
    "patronOf": "Earache sufferers, dysentery patients",
    "prayer": "St. Polycarp, faithful bishop, help us remain loyal to Christ throughout our lives.",
    "favors": "Perseverance in faith, courage in trials, and faithfulness to the end",
    "categories": ["Protection"]
  },
  {
    "name": "St. Justin Martyr",
    "title": "Philosopher and Martyr",
    "description": "A pagan philosopher who converted to Christianity after encountering an old man who spoke about the Hebrew prophets and Christ. He used his philosophical training to defend Christianity against intellectual attacks, writing influential apologies for the faith. He established a school in Rome where he taught Christian philosophy. He was martyred with six of his students after refusing to sacrifice to pagan gods, dying for both faith and reason.",
    "feastDay": "June 1",
    "born": "100",
    "died": "165",
    "patronOf": "Philosophers, apologists, lecturers",
    "prayer": "St. Justin Martyr, defender of the faith, help us explain our beliefs with wisdom and courage.",
    "favors": "Help with defending the faith, courage in martyrdom, and philosophical wisdom",
    "categories": ["Studies"]
  },
  {
    "name": "St. Ignatius of Antioch",
    "title": "Bishop and Martyr",
    "description": "The third Bishop of Antioch, possibly ordained by St. Peter himself. During his journey to Rome for martyrdom, he wrote seven letters that are among the earliest Christian documents outside the New Testament. He eagerly embraced martyrdom, writing that he wanted to be 'ground by the teeth of wild beasts to become pure bread of Christ.' His letters show early Christian understanding of the Eucharist and Church hierarchy.",
    "feastDay": "October 17",
    "born": "35",
    "died": "108",
    "patronOf": "Eastern Churches, throat problems",
    "prayer": "St. Ignatius of Antioch, help us desire union with Christ above all earthly things.",
    "favors": "Courage in martyrdom, love for the Eucharist, and Church unity",
    "categories": ["Protection"]
  },
  {
    "name": "St. Perpetua and St. Felicity",
    "title": "Martyrs and Mothers",
    "description": "Perpetua was a young noblewoman and new mother, while Felicity was her slave who gave birth in prison before their martyrdom. Both were catechumens arrested in Carthage during persecution in 203 AD. Perpetua's diary records her visions and her father's pleas to renounce her faith. Despite family pressure and maternal bonds, both women chose death rather than deny Christ, becoming powerful examples of faith transcending social boundaries.",
    "feastDay": "March 7",
    "born": "Perpetua: 181, Felicity: unknown",
    "died": "203",
    "patronOf": "Mothers, cattle, martyrs",
    "prayer": "Saints Perpetua and Felicity, give courage to mothers facing persecution and strengthen our faith.",
    "favors": "Help with courage in persecution and steadfastness in faith",
    "categories": ["Family", "Protection"]
  },
  {
    "name": "St. Lucy",
    "title": "Virgin and Martyr",
    "description": "A young Christian woman from Syracuse who vowed her virginity to Christ. When her mother arranged a marriage to a pagan, Lucy persuaded her to make a pilgrimage to St. Agatha's tomb, where her mother was healed. The rejected suitor denounced Lucy as a Christian. According to legend, her eyes were gouged out during torture, but she continued to see and prophesy. She is invoked for eye problems and as a light in darkness.",
    "feastDay": "December 13",
    "born": "283",
    "died": "304",
    "patronOf": "Eye problems, blindness, writers, salesmen",
    "prayer": "St. Lucy, virgin and martyr, enlighten our minds and heal our vision, both physical and spiritual.",
    "favors": "Help with healing of eye ailments, purity, and courage",
    "categories": ["Healing"]
  },
  {
    "name": "St. Barbara",
    "title": "Virgin and Martyr",
    "description": "A beautiful young woman whose pagan father kept her locked in a tower to preserve her beauty. While he was away, she converted to Christianity and had a third window added to her bathhouse to honor the Trinity. When her father discovered her faith, he was so enraged that he personally beheaded her, but was immediately struck by lightning. She is invoked against sudden death and lightning, and is the patron of those who work with explosives.",
    "feastDay": "December 4",
    "born": "3rd century",
    "died": "306",
    "patronOf": "Miners, artillery, sudden death, lightning protection",
    "prayer": "St. Barbara, protector from sudden death, help us live in readiness for eternity.",
    "favors": "Protection from lightning and sudden death, help in danger, and aid in courage",
    "categories": ["Protection"]
  },
  {
    "name": "St. Cecilia",
    "title": "Virgin and Martyr, Patron of Musicians",
    "description": "A Roman noblewoman who vowed her virginity to God but was forced to marry Valerian. On her wedding night, she converted her husband by telling him her guardian angel would punish him if he violated her vow. Both Valerian and his brother were martyred first, followed by Cecilia. Legend says she sang in her heart to God during her wedding, making her the patron of musicians. Her house became a church that still stands in Rome.",
    "feastDay": "November 22",
    "born": "200",
    "died": "230",
    "patronOf": "Musicians, singers, poets, Church music",
    "prayer": "St. Cecilia, patron of musicians, help us praise God with our voices and instruments.",
    "favors": "Help with music, purity, and protection during trials",
    "categories": ["Family"]
  },
  {
    "name": "St. George",
    "title": "Martyr and Dragon Slayer",
    "description": "A Roman soldier who was martyred for refusing to renounce his Christian faith during Diocletian's persecution. The legend of his slaying a dragon to save a princess symbolizes the victory of good over evil and faith over paganism. His courage in the face of torture made him a model for Christian soldiers. He became the patron saint of England and many other countries, representing the ideal of Christian knighthood.",
    "feastDay": "April 23",
    "born": "280",
    "died": "303",
    "patronOf": "England, soldiers, knights, Boy Scouts, skin diseases",
    "prayer": "St. George, courageous soldier, help us fight against evil and defend the innocent.",
    "favors": "Protection in battle, courage, and strength in faith",
    "categories": ["Protection"]
  },
  {
    "name": "St. Thomas Becket",
    "title": "Archbishop and Martyr",
    "description": "Once a close friend of King Henry II and his chancellor, Becket became Archbishop of Canterbury and defended Church rights against royal interference. His opposition to the king's attempts to control the Church led to increasing conflict. Four knights, thinking they were doing the king's will, murdered him in Canterbury Cathedral in 1170. His martyrdom shocked Europe and made Canterbury a major pilgrimage destination. He represents the Church's independence from secular power.",
    "feastDay": "December 29",
    "born": "1119",
    "died": "1170",
    "patronOf": "Clergy, Canterbury, Exeter College Oxford",
    "prayer": "St. Thomas Becket, defender of the Church, give courage to clergy and protect Church freedom.",
    "favors": "Help with courage, defense of the Church, and protection of clergy",
    "categories": ["Protection"]
  },
  {
    "name": "St. Joan of Arc",
    "title": "Maid of Orleans, Martyr",
    "description": "A peasant girl who claimed to receive visions from Saints Michael, Margaret, and Catherine, commanding her to crown the Dauphin as king and drive the English from France. At age 17, she convinced the court, led French forces to victory at Orleans, and saw Charles VII crowned. Captured by the English, she was tried for heresy and witchcraft and burned at the stake at age 19. Her conviction was later overturned, and she became a symbol of courage and patriotism.",
    "feastDay": "May 30",
    "born": "1412",
    "died": "1431",
    "patronOf": "France, soldiers, martyrs, prisoners",
    "prayer": "St. Joan of Arc, faithful to your visions, help us courageously follow God's will.",
    "favors": "Courage in battle, faithfulness, and perseverance",
    "categories": ["Protection"]
  },
  {
    "name": "St. Edmund Campion",
    "title": "Jesuit Martyr",
    "description": "An English Jesuit priest who returned to England during the Protestant persecution to minister to Catholics in secret. A brilliant scholar and former Anglican deacon, he wrote 'Ten Reasons' defending the Catholic faith. Despite operating under constant danger, he continued his missionary work until his capture. He was tortured and executed for treason, though his only crime was celebrating Mass and administering sacraments to English Catholics.",
    "feastDay": "December 1",
    "born": "1540",
    "died": "1581",
    "patronOf": "England, Jesuit students",
    "prayer": "St. Edmund Campion, fearless missionary, give us courage to share our faith despite persecution.",
    "favors": "Courage in faith, protection from persecution, and strength in trials",
    "categories": ["Protection"]
  }
]