[
  {
    "name": "Our Lady of Knock",
    "title": "Queen of Ireland",
    "description": "On August 21, 1879, fifteen people witnessed an apparition of Mary, St. Joseph, and St. John the Evangelist at the parish church in Knock, Ireland. The silent apparition lasted two hours in pouring rain, yet the wall remained dry. Mary appeared crowned, wearing white robes, with hands raised in prayer. This apparition brought hope during Ireland's difficult period and established Knock as a major pilgrimage site known for miraculous healings.",
    "feastDay": "August 21",
    "born": "Apparition 1879",
    "died": "Eternal",
    "patronOf": "Ireland, the sick, pilgrims",
    "prayer": "Our Lady of Knock, Queen of Ireland, you gave hope to your people in a time of distress, and comforted them in sorrow.",
    "favors": "Healing (physical and spiritual), consolation during suffering, and deepened faith",
    "categories": ["Healing"]
  },
  {
    "name": "Our Lady of Guadalupe",
    "title": "Patroness of the Americas",
    "description": "In 1531, Mary appeared to Juan Diego on Tepeyac Hill in Mexico, leaving her miraculous image on his tilma. Speaking in his native Nahuatl, she asked for a church to be built where she could show her love and compassion. The image, scientifically inexplicable, shows Mary as a pregnant mestiza, bridging indigenous and Spanish cultures. Her apparition led to millions of conversions and established her as Mother of the Americas.",
    "feastDay": "December 12",
    "born": "Apparition 1531",
    "died": "Eternal",
    "patronOf": "Americas, Mexico, unborn children, indigenous peoples",
    "prayer": "Our Lady of Guadalupe, Mother of the Americas, protect our families and bring healing to our nations.",
    "favors": "Miraculous healings, conversions, help with pregnancy",
    "categories": ["Family", "Healing"]
  },
  {
    "name": "Our Lady of Fatima",
    "title": "Our Lady of the Rosary",
    "description": "From May to October 1917, Mary appeared to three shepherd children in Fatima, Portugal, requesting prayer for world peace, conversion of sinners, and devotion to her Immaculate Heart. She revealed three secrets and performed the Miracle of the Sun before 70,000 witnesses. Her message emphasized the Rosary, penance, and consecration to her Immaculate Heart as means to world peace and the conversion of Russia.",
    "feastDay": "May 13",
    "born": "Apparition 1917",
    "died": "Eternal",
    "patronOf": "World peace, Portugal, the Rosary",
    "prayer": "Our Lady of Fatima, Queen of the Most Holy Rosary, obtain for us peace in the world and the conversion of sinners.",
    "favors": "Peace, conversion of sinners, and devotion to the Immaculate Heart of Mary",
    "categories": ["Family"]
  },
  {
    "name": "Our Lady of Lourdes",
    "title": "Our Lady of the Immaculate Conception",
    "description": "In 1858, Mary appeared eighteen times to 14-year-old Bernadette Soubirous in Lourdes, France, identifying herself as 'the Immaculate Conception.' She asked for prayer, penance, and the building of a chapel. Mary showed Bernadette a spring whose waters have brought countless healings. The Medical Bureau of Lourdes has officially recognized numerous miraculous cures, making Lourdes one of the world's most important pilgrimage sites.",
    "feastDay": "February 11",
    "born": "Apparition 1858",
    "died": "Eternal",
    "patronOf": "Sick people, invalids, bodily ills, France",
    "prayer": "Our Lady of Lourdes, Mother of Mercy, heal our bodies and souls and strengthen our faith.",
    "favors": "Help with physical and spiritual healing",
    "categories": ["Healing"]
  },
  {
    "name": "Our Lady of Perpetual Help",
    "title": "Mother of Perpetual Help",
    "description": "This ancient icon, likely painted in the 13th-14th century, shows Mary holding the Christ Child who clings to her after seeing a vision of his future passion. The icon was lost for 300 years before being miraculously rediscovered in Rome. Pope Pius IX entrusted it to the Redemptorists in 1866, and it has since become one of the most venerated Marian images worldwide, known for countless miracles and answered prayers.",
    "feastDay": "June 27",
    "born": "Ancient icon",
    "died": "Eternal",
    "patronOf": "Haiti, troubled situations, emergencies",
    "prayer": "Mother of Perpetual Help, you are the dispenser of all the gifts which God grants to us miserable sinners.",
    "favors": "Help with strength in trials, conversion, and protection",
    "categories": ["Family", "Impossible Causes"]
  },
  {
    "name": "Our Lady of Mount Carmel",
    "title": "Queen and Beauty of Carmel",
    "description": "On July 16, 1251, Mary appeared to St. Simon Stock and gave him the Brown Scapular, promising that whoever dies wearing it will not suffer eternal fire. The devotion traces back to the hermits on Mount Carmel who honored Mary as their patroness. The scapular represents Mary's promise of her protection and assistance, especially at the hour of death, for those devoted to her.",
    "feastDay": "July 16",
    "born": "Ancient devotion",
    "died": "Eternal",
    "patronOf": "Carmelites, Chile, protection from evil",
    "prayer": "Our Lady of Mount Carmel, flower of Carmel, protect us with your Brown Scapular and lead us to eternal life.",
    "favors": "Protection from evil, aid in spiritual warfare, and help with perseverance",
    "categories": ["Protection"]
  },
  {
    "name": "Our Lady of the Rosary",
    "title": "Queen of the Most Holy Rosary",
    "description": "According to tradition, Mary gave the Rosary to St. Dominic in 1208 as a weapon against heresy. The devotion was later promoted after the victory at the Battle of Lepanto in 1571, attributed to the Rosary. Mary has appeared numerous times requesting the Rosary, most notably at Fatima. The Rosary combines vocal and mental prayer, meditating on the mysteries of Christ's life while reciting Ave Marias.",
    "feastDay": "October 7",
    "born": "Ancient devotion",
    "died": "Eternal",
    "patronOf": "Rosary makers, victories, the Dominican Order",
    "prayer": "Our Lady of the Rosary, Queen of the Most Holy Rosary, make us worthy of your promises.",
    "favors": "Victory over sin, help with prayer life, and protection from spiritual dangers",
    "categories": ["Protection"]
  },
  {
    "name": "Our Lady of Sorrows",
    "title": "Mother of Sorrows",
    "description": "This devotion honors Mary's suffering during Christ's passion, focusing on seven sorrows: Simeon's prophecy, the flight into Egypt, losing Jesus in the temple, meeting Jesus on the way to Calvary, the crucifixion, taking Jesus from the cross, and his burial. Mary's compassionate suffering unites her uniquely with all who suffer. The devotion helps believers find meaning in their own sufferings through union with Mary's sorrowful heart.",
    "feastDay": "September 15",
    "born": "Ancient devotion",
    "died": "Eternal",
    "patronOf": "Sorrowful mothers, Slovakia, those in grief",
    "prayer": "Our Lady of Sorrows, Mother of mercy, grant us the grace to share in your sorrows and find comfort in your love.",
    "favors": "Strength in suffering, consolation in grief, and courage in trials",
    "categories": ["Family"]
  },
  {
    "name": "Mary Undoer of Knots",
    "title": "Undoer of Knots",
    "description": "This devotion originated from a 1700 painting in Germany showing Mary untying knots, representing her power to solve human problems. The devotion was popularized by Pope Francis, who discovered it in Germany. Mary is invoked to 'untie the knots' of our problems, conflicts, and difficulties. Each knot represents a specific problem or sin that Mary can help resolve through her intercession and maternal care.",
    "feastDay": "December 8",
    "born": "1700 painting",
    "died": "Eternal",
    "patronOf": "Problem solving, difficult situations, family conflicts",
    "prayer": "Mary, Undoer of Knots, untie the knots of our lives and lead us closer to your Son Jesus.",
    "favors": "Resolution of difficult problems, reconciliation, and peace in troubled relationships",
    "categories": ["Family", "Impossible Causes"]
  },
  {
    "name": "Our Lady of Good Counsel",
    "title": "Mother of Good Counsel",
    "description": "This ancient image miraculously appeared on a wall in Genazzano, Italy, in 1467, during the feast of St. Mark. The fresco, which came from Albania during the Turkish invasion, has remained preserved without visible means of support. Mary as Our Lady of Good Counsel is invoked for wisdom in decisions, guidance in difficulties, and divine direction in life's important choices. She is the patroness of good advice and wise decisions.",
    "feastDay": "April 26",
    "born": "Apparition 1467",
    "died": "Eternal",
    "patronOf": "Good decisions, students, counselors",
    "prayer": "Our Lady of Good Counsel, guide us in our decisions and help us choose what is pleasing to your Son.",
    "favors": "Wisdom in decisions, guidance in difficult situations, and help with family problems",
    "categories": ["Studies", "Family"]
  },
  {
    "name": "Immaculate Heart of Mary",
    "title": "Immaculate Heart",
    "description": "This devotion honors Mary's heart as the seat of her love for God and humanity, perfectly pure and immaculate. Promoted especially by St. John Eudes and later emphasized at Fatima, where Mary requested devotion to her Immaculate Heart as a path to peace. The heart represents Mary's perfect response to God's love and her maternal love for all humanity. The devotion includes the Five First Saturdays as requested at Fatima.",
    "feastDay": "Saturday after Sacred Heart",
    "born": "Ancient devotion",
    "died": "Eternal",
    "patronOf": "World peace, conversion, pure love",
    "prayer": "Immaculate Heart of Mary, refuge of sinners and mother of mercy, be our salvation.",
    "favors": "Help with conversion, peace, and deepening love for Jesus",
    "categories": ["Family"]
  },
  {
    "name": "Our Lady Star of the Sea",
    "title": "Stella Maris",
    "description": "This ancient title of Mary comes from St. Jerome's interpretation of the name 'Mary' as meaning 'star of the sea.' For centuries, sailors and travelers have invoked Mary under this title for protection during voyages. She guides the faithful through the storms of life to the safe harbor of heaven. The devotion symbolizes Mary as the guiding star that leads to Christ, the Light of the world.",
    "feastDay": "Various dates",
    "born": "Ancient devotion",
    "died": "Eternal",
    "patronOf": "Sailors, travelers, naval officers, fishermen",
    "prayer": "Our Lady Star of the Sea, guide us safely through life's storms to the harbor of eternal peace.",
    "favors": "Safe travel, protection of sailors, and guidance in life's journey",
    "categories": ["Protection", "Journey Mercy"]
  }
]