[
  {
    "name": "Blessed Carlo Acutis",
    "title": "Computer Programmer and Eucharistic Apostle",
    "description": "A modern teenager who used technology to spread faith, Carlo created a website cataloging Eucharistic miracles worldwide. Known for his deep devotion to the Eucharist and the Rosary, he attended daily Mass and spent time in Adoration. Despite his privileged background, he was charitable to the poor and maintained profound simplicity. His witness shows how young people can live saintly lives in the digital age.",
    "feastDay": "October 12",
    "born": "1991",
    "died": "2006",
    "patronOf": "Internet, computer programmers, youth",
    "prayer": "Blessed Carlo Acutis, help us use technology to spread the Gospel and deepen our love for the Eucharist.",
    "favors": "Help with technology, youth faith, and miracles related to Eucharistic devotion",
    "categories": ["Studies"]
  },
  {
    "name": "Blessed Fr Michael McGivney",
    "title": "Founder of the Knights of Columbus",
    "description": "An Irish-American priest who founded the Knights of Columbus in 1882 to provide financial security for Catholic families and strengthen men in their faith. He served the poor immigrant communities in Connecticut with dedication. His fraternal organization grew to become the world's largest Catholic fraternal service organization, embodying his vision of Catholic men supporting each other and their communities.",
    "feastDay": "August 13",
    "born": "1852",
    "died": "1890",
    "patronOf": "Fathers, parish priests, Knights of Columbus",
    "prayer": "Blessed Michael McGivney, strengthen fathers in their faith and help them provide for their families.",
    "favors": "Aid in family life, priestly vocations, and support for the Knights of Columbus",
    "categories": ["Family"]
  },
  {
    "name": "Blessed Francis Xavier Seelos",
    "title": "Redemptorist Missionary",
    "description": "A German-born Redemptorist priest who ministered to German-speaking immigrants in America. Known for his joyful disposition, pastoral care, and healing ministry. He served in various parishes and was renowned for his work with the sick during a yellow fever epidemic in New Orleans. His cheerful holiness and dedication to the marginalized made him beloved by all who knew him.",
    "feastDay": "October 5",
    "born": "1819",
    "died": "1867",
    "patronOf": "New Orleans, those with incurable illnesses",
    "prayer": "Blessed Francis Xavier Seelos, bring healing to the sick and comfort to those who suffer.",
    "favors": "Healing, comfort in suffering, and perseverance in faith",
    "categories": ["Healing"]
  },
  {
    "name": "Blessed Stanley Rother",
    "title": "Martyr of Guatemala",
    "description": "An American priest from Oklahoma who served the indigenous people of Guatemala for thirteen years. Despite threats from the military regime, he refused to abandon his people during the civil war. He was murdered in his rectory in 1981, becoming the first martyr from the United States. His love for the Tz'utujil people and ultimate sacrifice exemplify pastoral dedication.",
    "feastDay": "July 28",
    "born": "1935",
    "died": "1981",
    "patronOf": "Missionaries, Guatemala, persecuted priests",
    "prayer": "Blessed Stanley Rother, give courage to missionaries and protect those who serve the poor.",
    "favors": "Courage in faith, protection for missionaries, and intercession for priests",
    "categories": ["Protection"]
  },
  {
    "name": "Blessed Miguel Agustin Pro",
    "title": "Martyr of the Cristero War",
    "description": "A Mexican Jesuit priest who ministered secretly during religious persecution, often disguising himself to avoid capture. Known for his joy, humor, and fearless service to the faithful during the Cristero War. He was falsely accused of attempting to assassinate the Mexican president and executed without trial in 1927. His final words were 'Viva Cristo Rey!' (Long live Christ the King!).",
    "feastDay": "November 23",
    "born": "1891",
    "died": "1927",
    "patronOf": "Mexico, persecuted Christians, falsely accused",
    "prayer": "Blessed Miguel Pro, give us courage to profess our faith boldly, even in persecution.",
    "favors": "Boldness in faith, protection against persecution, and help with conversion",
    "categories": ["Protection"]
  },
  {
    "name": "Blessed Pier Giorgio Frassati",
    "title": "Man of the Beatitudes",
    "description": "An Italian student who lived the Gospel with extraordinary joy and dedication to the poor. Despite his wealthy family background, he secretly gave away money and clothing to those in need. An avid mountaineer and student activist, he combined intense prayer life with social action. His infectious joy and commitment to justice inspire young people to live their faith authentically.",
    "feastDay": "July 4",
    "born": "1901",
    "died": "1925",
    "patronOf": "Young people, mountaineers, World Youth Day",
    "prayer": "Blessed Pier Giorgio Frassati, help us live our faith with joy and serve the poor with love.",
    "favors": "Strength in living a joyful Christian life, help for the poor, and guidance in social justice",
    "categories": ["Studies"]
  },
  {
    "name": "Blessed Solanus Casey",
    "title": "The Doorkeeper of Detroit",
    "description": "An American Capuchin friar who served as porter (doorkeeper) at monasteries for decades. Though not allowed to preach due to academic struggles, his simple counseling and powerful intercession brought healing to thousands. Known for his gentleness, humor, and trust in God's providence. People traveled from across the country to speak with him and receive his blessing.",
    "feastDay": "July 31",
    "born": "1870",
    "died": "1957",
    "patronOf": "Those with learning disabilities, doorkeepers, Detroit",
    "prayer": "Blessed Solanus Casey, help us trust in God's goodness and find hope in difficult times.",
    "favors": "Healing, hope in difficult situations, and aid for those in poverty",
    "categories": ["Healing"]
  },
  {
    "name": "St. Josemaria Escriva",
    "title": "Founder of Opus Dei",
    "description": "A Spanish priest who founded Opus Dei, promoting the universal call to holiness through ordinary work. He taught that every honest job can be a path to sanctity when done with love for God. His spirituality emphasizes finding God in daily activities, professional excellence, and apostolic outreach. His writings on lay spirituality have influenced millions worldwide in seeking holiness in secular life.",
    "feastDay": "June 26",
    "born": "1902",
    "died": "1975",
    "patronOf": "Opus Dei, secular institutes, lay people",
    "prayer": "St. Josemaria Escriva, help us sanctify our daily work and find God in ordinary activities.",
    "favors": "Help in sanctifying daily work, courage in faith, and guidance in lay spirituality",
    "categories": ["Jobs"]
  },
  {
    "name": "Mother Teresa of Calcutta",
    "title": "Saint of the Gutters",
    "description": "An Albanian-born nun who dedicated her life to serving the poorest of the poor in Calcutta. She saw Jesus in the distressing disguise of the poor and dying, offering them dignity and love in their final moments. Despite experiencing spiritual darkness for decades, she continued her mission with unwavering faith. Her Missionaries of Charity spread worldwide, continuing her work with the destitute.",
    "feastDay": "September 5",
    "born": "1910",
    "died": "1997",
    "patronOf": "Missionaries, the poor, Calcutta, India",
    "prayer": "Mother Teresa, help us see Jesus in the poorest and most abandoned, and serve them with love.",
    "favors": "Charity, compassion, and aid in serving the poorest",
    "categories": ["Healing"]
  },
  {
    "name": "Pope St. John Paul II",
    "title": "The Great Pope",
    "description": "A Polish pope who led the Church for 27 years, playing a crucial role in ending communism in Eastern Europe. Known for his extensive travels, prolific writings, and deep devotion to Mary. He survived an assassination attempt and transformed the papacy through his charismatic presence. His pontificate was marked by his defense of human dignity, family values, and the culture of life.",
    "feastDay": "October 22",
    "born": "1920",
    "died": "2005",
    "patronOf": "Young people, families, Poland, World Youth Day",
    "prayer": "St. John Paul II, strengthen our faith and help us build a civilization of love.",
    "favors": "Strengthening of faith, help with vocations, and intercession for youth",
    "categories": ["Family"]
  },
  {
    "name": "Saints Louis and Zelie Martin",
    "title": "Parents of St. Thérèse",
    "description": "A French couple who exemplified Christian marriage and family life. Louis was a watchmaker and Zelie a lacemaker who ran successful businesses while raising nine children with deep faith. Five of their daughters became nuns, including St. Thérèse of Lisieux. They showed that holiness is possible in married life through mutual love, sacrifice, and dedication to raising children in faith.",
    "feastDay": "July 12",
    "born": "Louis: 1823, Zelie: 1831",
    "died": "Zelie: 1877, Louis: 1894",
    "patronOf": "Parents, married couples, large families",
    "prayer": "Saints Louis and Zelie Martin, help us live holy marriages and raise our children in faith.",
    "favors": "Holiness in family life, perseverance, and help in parenting",
    "categories": ["Family"]
  },
  {
    "name": "Saints Jacinta and Francisco",
    "title": "Visionaries of Fatima",
    "description": "Two young shepherd children who, with their cousin Lucia, witnessed the apparitions of Our Lady at Fatima in 1917. Francisco was known for his love of God and desire to console Jesus, while Jacinta showed remarkable maturity in understanding the need for prayer and sacrifice for sinners. Both died young during the 1918 flu pandemic, having offered their sufferings for the conversion of souls.",
    "feastDay": "February 20",
    "born": "Francisco: 1908, Jacinta: 1910",
    "died": "Francisco: 1919, Jacinta: 1920",
    "patronOf": "Children, shepherds, Portugal",
    "prayer": "Saints Francisco and Jacinta, help us pray the Rosary faithfully and offer sacrifices for sinners.",
    "favors": "Conversion of sinners, healing, and perseverance in faith",
    "categories": ["Family", "Healing"]
  },
  {
    "name": "St. Gianna Beretta Molla",
    "title": "Mother and Doctor",
    "description": "An Italian pediatrician who chose to save her unborn child's life rather than undergo treatment that would have terminated the pregnancy. A devoted wife and mother of three, she balanced her medical career with family life. When faced with a difficult pregnancy that threatened her life, she chose to give birth, saying her child's life was more important than her own. She died a week after delivery.",
    "feastDay": "April 28",
    "born": "1922",
    "died": "1962",
    "patronOf": "Mothers, physicians, unborn children",
    "prayer": "St. Gianna Beretta Molla, protect mothers and their unborn children, and help us choose life.",
    "favors": "Help with motherhood, courage in illness, and protection of life",
    "categories": ["Family", "Healing"]
  },
  {
    "name": "St. Maximilian Kolbe",
    "title": "Martyr of Charity",
    "description": "A Polish Franciscan friar who volunteered to die in place of a stranger at Auschwitz concentration camp. Known for his devotion to the Immaculate Virgin and his use of modern media to spread the Gospel. He founded a monastery and published magazines to promote Marian devotion. His ultimate sacrifice of love exemplifies Christ's teaching that greater love has no one than to lay down life for friends.",
    "feastDay": "August 14",
    "born": "1894",
    "died": "1941",
    "patronOf": "Drug addicts, political prisoners, families, journalists",
    "prayer": "St. Maximilian Kolbe, help us love others as Christ loved us, even unto death.",
    "favors": "Help with courage in suffering, martyrdom, and Marian devotion",
    "categories": ["Family", "Protection"]
  },
  {
    "name": "St. Faustina",
    "title": "Apostle of Divine Mercy",
    "description": "A Polish nun who received mystical visions of Jesus asking her to promote devotion to Divine Mercy. Jesus taught her the Chaplet of Divine Mercy and requested the image of Divine Mercy with the words 'Jesus, I trust in You.' Her diary records profound mystical experiences and Jesus' promises regarding the devotion. The Divine Mercy devotion has spread worldwide, emphasizing God's infinite mercy.",
    "feastDay": "October 5",
    "born": "1905",
    "died": "1938",
    "patronOf": "Divine Mercy devotion, Poland, mercy",
    "prayer": "St. Faustina, help us trust in Jesus' Divine Mercy and share it with others.",
    "favors": "Mercy, healing, and trust in Divine Mercy",
    "categories": ["Healing"]
  }
]