[
  {
    "name": "St. Philip Neri",
    "title": "Apostle of Rome",
    "description": "An Italian priest known for his joy, humor, and innovative approach to spiritual direction. He founded the Congregation of the Oratory and developed informal spiritual conferences with music and discussions. His cheerful personality and practical jokes earned him the nickname 'Second Jester of the Lord.' He experienced mystical phenomena including levitation during Mass. His apostolate in Rome attracted people from all walks of life, and his joyful holiness showed that sanctity and humor could go together.",
    "feastDay": "May 26",
    "born": "1515",
    "died": "1595",
    "patronOf": "Rome, humor, joy, U.S. Special Forces",
    "prayer": "St. Philip Neri, joyful saint, help us find God in laughter and serve others with cheerful hearts.",
    "favors": "Help with joy in faith, humor, and spiritual renewal",
    "categories": ["Family"]
  },
  {
    "name": "St. Raymond Nonatus",
    "title": "Patron of Midwives",
    "description": "A Spanish Mercedarian friar born by cesarean section after his mother's death, hence 'non natus' (not born naturally). He dedicated his life to ransoming Christian captives from Muslim pirates. When funds ran out, he offered himself as hostage and was imprisoned and tortured. He continued preaching to fellow prisoners until ransomed. His devotion to freeing captives and his miraculous birth made him patron of childbirth and difficult pregnancies.",
    "feastDay": "August 31",
    "born": "1204",
    "died": "1240",
    "patronOf": "Midwives, pregnant women, children, fever",
    "prayer": "St. Raymond Nonatus, protector of mothers, watch over women in childbirth and free all who are enslaved.",
    "favors": "Help with childbirth protection, against obstetric dangers, and freedom from imprisonment",
    "categories": ["Family", "Healing"]
  },
  {
    "name": "St. Raymond Penyafort",
    "title": "Master General of Dominicans",
    "description": "A Spanish Dominican priest who compiled the Decretals for Pope Gregory IX and served as Master General of the Dominican Order. He was known for his knowledge of canon law and his work in organizing Church legislation. He founded schools for learning Arabic and Hebrew to facilitate conversion of Muslims and Jews. According to legend, he traveled from Majorca to Barcelona by boat using his cloak as a sail when the king refused him passage.",
    "feastDay": "January 7",
    "born": "1175",
    "died": "1275",
    "patronOf": "Canon lawyers, medical record librarians",
    "prayer": "St. Raymond Penyafort, wise legislator, help us work for justice and defend the rights of all people.",
    "favors": "Help with legal matters, justice, and protection of confessors",
    "categories": ["Protection", "Studies"]
  },
  {
    "name": "St. Rocco",
    "title": "Plague Saint",
    "description": "A French pilgrim who cared for plague victims during the 14th century Black Death. Born into wealth, he gave away his inheritance and traveled to Italy to care for the sick. He miraculously healed many plague sufferers until he contracted the disease himself. A dog reportedly brought him food daily while he recovered in the forest. He is invoked against plague and contagious diseases, and his cult spread rapidly during plague outbreaks.",
    "feastDay": "August 16",
    "born": "1295",
    "died": "1327",
    "patronOf": "Plague victims, dogs, invalids, surgeons",
    "prayer": "St. Rocco, healer of the plague-stricken, protect us from contagious diseases and help us care for the sick.",
    "favors": "Help with protection from contagious diseases and healing from illness",
    "categories": ["Healing"]
  },
  {
    "name": "St. Scholastica",
    "title": "Sister of St. Benedict",
    "description": "The twin sister of St. Benedict who founded a convent near his monastery at Monte Cassino. She met with her brother annually to discuss spiritual matters. According to St. Gregory's 'Dialogues,' she died three days after their final meeting, during which she had prayed for a storm to keep Benedict longer. Benedict saw her soul ascending to heaven as a dove. She represents the contemplative life and the spiritual bonds between religious communities.",
    "feastDay": "February 10",
    "born": "480",
    "died": "547",
    "patronOf": "Benedictine nuns, convulsive children, rain",
    "prayer": "St. Scholastica, contemplative sister, help us deepen our prayer life and strengthen family bonds.",
    "favors": "Help with protection of monasteries, family, and peaceful death",
    "categories": ["Family"]
  },
  {
    "name": "St. Teresa of the Andes",
    "title": "Little Flower of the Andes",
    "description": "A Chilean Carmelite nun who died at age 19 after living an extraordinarily holy life. Born to a wealthy family, she felt called to religious life from childhood and joined the Carmelites despite family opposition. She lived only 11 months in the convent before dying of typhus, but left behind letters and diary entries revealing profound spiritual maturity. She was the first saint from Chile and is beloved throughout Latin America.",
    "feastDay": "April 12",
    "born": "1900",
    "died": "1920",
    "patronOf": "Young people, sick people, Chile",
    "prayer": "St. Teresa of the Andes, young Carmelite, help youth respond generously to God's call.",
    "favors": "Help with purity, holiness, and guidance for young people",
    "categories": ["Family", "Studies"]
  },
  {
    "name": "St. Thomas Aquinas",
    "title": "Angelic Doctor",
    "description": "An Italian Dominican priest and theologian whose 'Summa Theologica' became the standard Catholic theological text. He synthesized Aristotelian philosophy with Christian doctrine, showing the harmony between faith and reason. His theological method influenced Catholic education for centuries. Despite his family's opposition to his religious vocation, he persevered and became one of the Church's greatest intellectual giants. His feast day is celebrated by students worldwide.",
    "feastDay": "January 28",
    "born": "1225",
    "died": "1274",
    "patronOf": "Students, schools, philosophers, theologians",
    "prayer": "St. Thomas Aquinas, angelic doctor, enlighten our minds and help us seek truth through study and prayer.",
    "favors": "Help with wisdom, learning, and clarity of mind",
    "categories": ["Studies"]
  },
  {
    "name": "St. Thomas More",
    "title": "Man for All Seasons",
    "description": "An English lawyer, author, and Lord Chancellor who was martyred for refusing to acknowledge Henry VIII as head of the Church in England. A Renaissance humanist and friend of Erasmus, he wrote 'Utopia' and was known for his wit and integrity. Despite his high position and close friendship with the king, he chose conscience over convenience. His martyrdom for papal supremacy and his example of principled public service made him patron of politicians and lawyers.",
    "feastDay": "June 22",
    "born": "1478",
    "died": "1535",
    "patronOf": "Lawyers, politicians, statesmen, difficult marriages",
    "prayer": "St. Thomas More, man of integrity, help us choose conscience over convenience and serve with honor.",
    "favors": "Help with integrity, courage in faith, and justice",
    "categories": ["Protection", "Studies"]
  },
  {
    "name": "St. Valentine",
    "title": "Patron of Lovers",
    "description": "A Roman priest (possibly bishop) who was martyred during the reign of Emperor Claudius II. According to tradition, he secretly performed Christian weddings when the emperor banned marriage for young soldiers. He was imprisoned and beaten, then beheaded on February 14. His association with courtly love developed in medieval times, making him patron of lovers. While historical details are uncertain, his feast became associated with romantic love and devotion.",
    "feastDay": "February 14",
    "born": "3rd century",
    "died": "269",
    "patronOf": "Lovers, happy marriages, young people, beekeepers",
    "prayer": "St. Valentine, patron of love, bless all marriages and help couples grow in faithful love.",
    "favors": "Help with love, happy marriages, and protection of youth",
    "categories": ["Family"]
  },
  {
    "name": "St. Vincent Ferrer",
    "title": "Angel of the Apocalypse",
    "description": "A Spanish Dominican priest famous for his powerful preaching throughout Europe during the Western Schism. He reportedly worked miracles including raising the dead and speaking in tongues so all could understand him. He preached penance and preparation for the Last Judgment, earning the nickname 'Angel of the Apocalypse.' His missions brought about mass conversions and reconciliations. He helped end the Western Schism by convincing the Avignon pope to abdicate.",
    "feastDay": "April 5",
    "born": "1350",
    "died": "1419",
    "patronOf": "Builders, plumbers, orphans, those seeking lost articles",
    "prayer": "St. Vincent Ferrer, powerful preacher, give us zeal for souls and courage to call others to conversion.",
    "favors": "Help with preaching, conversion, and protection from evil",
    "categories": ["Studies"]
  },
  {
    "name": "Saints Cosmas and Damian",
    "title": "Holy Unmercenaries",
    "description": "Twin brothers who were physicians in Syria and provided medical care without charge, earning the title 'Unmercenaries.' They were Christians who combined medical practice with evangelization, often performing miraculous healings through prayer. They were martyred during Diocletian's persecution. Their cult spread throughout the Christian world, and they became patron saints of physicians, surgeons, and pharmacists. Many churches and hospitals were dedicated to them.",
    "feastDay": "September 26",
    "born": "3rd century",
    "died": "287",
    "patronOf": "Physicians, surgeons, pharmacists, medical workers",
    "prayer": "Saints Cosmas and Damian, holy healers, guide medical workers and bring healing to the sick.",
    "favors": "Help with healing, especially of illnesses and medical professions",
    "categories": ["Healing"]
  },
  {
    "name": "Saints Joachim and Anne",
    "title": "Parents of the Blessed Virgin Mary",
    "description": "According to tradition, the parents of the Virgin Mary who conceived her after years of childlessness through divine intervention. Though not mentioned in canonical Scripture, they appear in the apocryphal Gospel of James. Joachim was reportedly a wealthy shepherd, and Anne came from a priestly family. Their story of faithful waiting and answered prayer makes them patrons of grandparents and childless couples. They represent the preparation for Christ's coming through faithful Jewish families.",
    "feastDay": "July 26",
    "born": "1st century BC",
    "died": "1st century AD",
    "patronOf": "Grandparents, childless couples, housekeepers",
    "prayer": "Saints Joachim and Anne, holy grandparents, bless our families and help us raise children in faith.",
    "favors": "Help with family blessings, fertility, and grandparents",
    "categories": ["Family"]
  },
  {
    "name": "Saints Peter and Paul",
    "title": "Pillars of the Church",
    "description": "The two great apostles who, despite their different backgrounds and personalities, became the foundation of the early Church. Peter, the fisherman, was chosen as the first pope, while Paul, the former persecutor, became the apostle to the Gentiles. Their feast is celebrated together to honor their joint witness to Christ in Rome, where both were martyred. They represent the universality of the Church and the different paths to sainthood.",
    "feastDay": "June 29",
    "born": "1st century",
    "died": "64 AD",
    "patronOf": "Rome, converts, the Church's mission",
    "prayer": "Saints Peter and Paul, pillars of the Church, strengthen our faith and help us spread the Gospel.",
    "favors": "Help with courage, leadership in faith, and conversion",
    "categories": ["Studies", "Protection"]
  },
  {
    "name": "The Holy Innocents",
    "title": "First Martyrs",
    "description": "The male children under two years old who were killed by King Herod in his attempt to eliminate the Christ child. Though they died unknowingly, the Church honors them as the first martyrs who died for Christ. Their feast celebrates the sanctity of innocent life and God's protection of the vulnerable. They represent all children who suffer violence and are invoked for the protection of children and the unborn.",
    "feastDay": "December 28",
    "born": "1st century BC",
    "died": "1st century BC",
    "patronOf": "Children, innocence, altar servers",
    "prayer": "Holy Innocents, first martyrs, protect all children and defend the sanctity of life.",
    "favors": "Help with protection of children and the unborn",
    "categories": ["Family", "Protection"]
  },
  {
    "name": "St. Martin of Tours",
    "title": "Soldier Saint",
    "description": "A Roman soldier who became a bishop and is considered the father of monasticism in Gaul (France). Famous for cutting his military cloak in half to share with a beggar, after which he had a vision of Christ wearing the cloak. He left military service to become a monk and later bishop of Tours. He evangelized rural areas and opposed Arianism. His combination of military background, monastic life, and episcopal service made him one of the most popular saints in medieval Europe.",
    "feastDay": "November 11",
    "born": "316",
    "died": "397",
    "patronOf": "Soldiers, cavalry, military chaplains, France",
    "prayer": "St. Martin of Tours, generous soldier, help us share with the needy and serve with courage.",
    "favors": "Help with charity, courage, and protection of soldiers",
    "categories": ["Protection"]
  }
]