[
  {
    "name": "St. Teresa of Avila",
    "title": "Doctor of the Church, Mystic",
    "description": "A Spanish Carmelite nun who reformed her order and wrote profound mystical works including 'The Interior Castle' and 'The Way of Perfection.' She experienced mystical visions and ecstasies while founding seventeen reformed Carmelite convents. Her writings on prayer and the spiritual life remain classics of Christian mysticism. She taught the four stages of prayer leading to mystical union with God, combining practical wisdom with deep theological insight.",
    "feastDay": "October 15",
    "born": "1515",
    "died": "1582",
    "patronOf": "Spain, sick people, writers, chess players",
    "prayer": "St. Teresa of Avila, teach us to pray with devotion and seek union with God in the interior castle of our souls.",
    "favors": "Help with prayer, spiritual growth, and perseverance",
    "categories": ["Studies"]
  },
  {
    "name": "St. John of the Cross",
    "title": "Doctor of the Church, Mystic",
    "description": "A Spanish Carmelite friar who worked with St. Teresa of Avila to reform the Carmelite order. His mystical writings, including 'Dark Night of the Soul' and 'The Ascent of Mount Carmel,' describe the soul's journey to union with God through purification and detachment. He endured imprisonment and persecution from his own order but continued to write poetry and prose that rank among the greatest works of Spanish literature and Christian mysticism.",
    "feastDay": "December 14",
    "born": "1542",
    "died": "1591",
    "patronOf": "Mystics, contemplatives, Spanish poets",
    "prayer": "St. John of the Cross, guide us through the dark nights of the soul to the light of divine union.",
    "favors": "Help with spiritual growth, perseverance in suffering, and mystical union with God",
    "categories": ["Studies"]
  },
  {
    "name": "St. Catherine of Siena",
    "title": "Doctor of the Church, Mystic",
    "description": "A Dominican tertiary who never learned to read but dictated profound theological works including 'The Dialogue.' She convinced Pope Gregory XI to return from Avignon to Rome, ending the Papal exile. Known for her mystical visions, stigmata, and political influence despite being a laywoman. Her letters to popes, kings, and commoners show remarkable theological insight and passionate love for the Church. She lived on the Eucharist alone for years.",
    "feastDay": "April 29",
    "born": "1347",
    "died": "1380",
    "patronOf": "Italy, Europe, nurses, fire prevention",
    "prayer": "St. Catherine of Siena, give us courage to speak truth to power and work for Church reform.",
    "favors": "Help with difficult decisions, healing, and courage in faith",
    "categories": ["Healing", "Studies"]
  },
  {
    "name": "St. Bridget of Sweden",
    "title": "Mystic and Foundress",
    "description": "A Swedish noblewoman who founded the Bridgettine order after her husband's death. She received over 700 mystical revelations about Christ's life and passion, recorded in eight books. Her visions included detailed accounts of the Nativity and Crucifixion that influenced Christian art and devotion. She made pilgrimages to Rome and the Holy Land, working for Church reform and papal return from Avignon. Her revelations emphasized devotion to Christ's humanity.",
    "feastDay": "July 23",
    "born": "1303",
    "died": "1373",
    "patronOf": "Sweden, Europe, widows, pilgrims",
    "prayer": "St. Bridget of Sweden, help us deepen our love for Christ's passion and find peace in suffering.",
    "favors": "Peace, deepening spiritual life, and help during suffering or spiritual dryness",
    "categories": ["Family"]
  },
  {
    "name": "St. Gertrude the Great",
    "title": "Mystic of the Sacred Heart",
    "description": "A German Benedictine nun who experienced profound mystical visions, especially of the Sacred Heart of Jesus. Her writings 'The Herald of Divine Love' record her mystical experiences and helped spread devotion to the Sacred Heart centuries before St. Margaret Mary. She was known for her learning, humility, and powerful intercession for the souls in Purgatory. Jesus promised her that her prayers would be especially effective for releasing souls from Purgatory.",
    "feastDay": "November 16",
    "born": "1256",
    "died": "1302",
    "patronOf": "Souls in Purgatory, mystics, West Indies",
    "prayer": "St. Gertrude the Great, help us grow in devotion to the Sacred Heart and pray for the souls in Purgatory.",
    "favors": "Help with prayers for the souls in Purgatory and deepening of faith",
    "categories": ["Family"]
  },
  {
    "name": "St. Veronica Giuliani",
    "title": "Mystic and Stigmatist",
    "description": "An Italian Capuchin Poor Clare who received the stigmata and experienced mystical visions of Christ's passion. She kept a detailed diary of her spiritual experiences spanning thirty-four years, recording over 4,000 pages of mystical insights. Her heart was found after death to contain instruments of Christ's passion formed in the flesh. She served as abbess while maintaining rigorous ascetical practices and deep contemplative prayer, combining mystical experience with practical leadership.",
    "feastDay": "July 9",
    "born": "1660",
    "died": "1727",
    "patronOf": "Capuchin Poor Clares, mystics",
    "prayer": "St. Veronica Giuliani, help us unite our sufferings with Christ's passion and grow in mystical prayer.",
    "favors": "Help with mystical prayer, suffering, and holiness",
    "categories": ["Healing"]
  },
  {
    "name": "St. Margaret Mary Alacoque",
    "title": "Apostle of the Sacred Heart",
    "description": "A French Visitation nun who received visions of Jesus revealing his Sacred Heart and requesting devotion to it. Jesus showed her his heart crowned with thorns, explaining that devotion to his Sacred Heart would bring many graces. She promoted the First Friday devotions and the feast of the Sacred Heart despite opposition from her community. Her spiritual director, St. Claude de la Colombière, helped establish this now-universal Catholic devotion.",
    "feastDay": "October 16",
    "born": "1647",
    "died": "1690",
    "patronOf": "Devotees of Sacred Heart, polio patients",
    "prayer": "St. Margaret Mary Alacoque, increase our devotion to the Sacred Heart and help us make reparation for sins.",
    "favors": "Help with devotion to the Sacred Heart, love, and mercy",
    "categories": ["Family", "Healing"]
  },
  {
    "name": "St. Rose of Lima",
    "title": "First Saint of the Americas",
    "description": "The first canonized saint born in the Americas, Rose lived as a Dominican tertiary in Peru. Known for her extreme penances, mystical experiences, and care for the poor and sick in her family's garden. She took a vow of virginity and resisted family pressure to marry, dedicating herself entirely to prayer and works of mercy. Her mystical marriage to Christ and heroic charity made her a model for contemplatives and caregivers throughout Latin America.",
    "feastDay": "August 23",
    "born": "1586",
    "died": "1617",
    "patronOf": "Peru, South America, Philippines, florists",
    "prayer": "St. Rose of Lima, first flower of sanctity in the Americas, help us grow in purity and charity.",
    "favors": "Help with purity, family protection, and care for the sick",
    "categories": ["Family", "Healing"]
  },
  {
    "name": "St. Gemma Galgani",
    "title": "Mystic and Stigmatist",
    "description": "An Italian laywoman who experienced mystical phenomena including the stigmata, visions of Jesus and Mary, and conversations with her guardian angel. Despite her family's financial struggles and her own poor health, she maintained deep prayer life and desired to become a Passionist nun. Her spiritual diary records her mystical experiences and shows remarkable spiritual maturity. She offered her sufferings for the conversion of sinners and the missions.",
    "feastDay": "April 11",
    "born": "1878",
    "died": "1903",
    "patronOf": "Students, pharmacists, back pain sufferers",
    "prayer": "St. Gemma Galgani, help us accept suffering with love and maintain devotion despite trials.",
    "favors": "Healing, help in suffering, and perseverance in faith",
    "categories": ["Healing", "Studies"]
  },
  {
    "name": "St. Elizabeth of the Trinity",
    "title": "Carmelite Mystic",
    "description": "A French Carmelite nun who lived only six years in religious life but left profound spiritual writings on the Trinity dwelling within the soul. Her letters and retreat notes reveal deep theological understanding of the indwelling Trinity and the call to become a 'praise of glory.' Despite suffering from Addison's disease, she maintained joyful trust in God's love and taught others to find God within their souls through prayer and sacrifice.",
    "feastDay": "November 8",
    "born": "1880",
    "died": "1906",
    "patronOf": "Loss of parents, sick people",
    "prayer": "St. Elizabeth of the Trinity, help us discover the Trinity dwelling within our souls and become praise of glory.",
    "favors": "Help with faith, hope, and love in suffering",
    "categories": ["Family", "Healing"]
  },
  {
    "name": "St. Mary Magdalene de Pazzi",
    "title": "Carmelite Mystic",
    "description": "An Italian Carmelite nun known for her mystical experiences and ecstasies that lasted for years. During these states, she would speak about divine mysteries while her sisters recorded her words, creating valuable mystical literature. She experienced mystical marriage with Christ and visions of purgatory and heaven. Her intense prayer life was combined with practical service to her community, showing that mystical experience enhances rather than replaces ordinary Christian duties.",
    "feastDay": "May 25",
    "born": "1566",
    "died": "1607",
    "patronOf": "Sicily, those suffering from illness",
    "prayer": "St. Mary Magdalene de Pazzi, help us combine deep prayer with faithful service to others.",
    "favors": "Help with spiritual renewal, mystical prayer, and purity",
    "categories": ["Healing"]
  },
  {
    "name": "St. Catherine of Genoa",
    "title": "Mystic and Hospital Administrator",
    "description": "An Italian noblewoman who experienced conversion and mystical union with God while living an active life caring for the sick. She managed Genoa's largest hospital for decades while experiencing profound mystical states. Her treatise on Purgatory, based on mystical insights, influenced Catholic teaching on the afterlife. She showed that mystical experience could be combined with active service, particularly caring for plague victims during several epidemics.",
    "feastDay": "September 15",
    "born": "1447",
    "died": "1510",
    "patronOf": "Hospitals, nurses, widows",
    "prayer": "St. Catherine of Genoa, help us find God in service to the sick and suffering.",
    "favors": "Help with hospital work, mystical prayer, and service to the sick",
    "categories": ["Healing"]
  },
  {
    "name": "St. Julian of Norwich",
    "title": "Mystic and Anchoress",
    "description": "An English anchoress who received sixteen visions of Christ's passion during a near-death illness. Her 'Revelations of Divine Love' is considered the first book written by a woman in English and contains the famous phrase 'All shall be well.' She lived as a hermit for decades, offering spiritual counsel to visitors while reflecting on her mystical experiences. Her optimistic theology emphasizes God's love and mercy over judgment.",
    "feastDay": "May 8",
    "born": "1342",
    "died": "1416",
    "patronOf": "Sick people, those seeking spiritual direction",
    "prayer": "St. Julian of Norwich, help us trust that all shall be well in God's loving providence.",
    "favors": "Help with trust in God's love, spiritual direction, and hope in trials",
    "categories": ["Healing"]
  },
  {
    "name": "St. Hildegard of Bingen",
    "title": "Doctor of the Church, Mystic",
    "description": "A German Benedictine abbess who was a polymath: mystic, composer, philosopher, physician, and writer. She received mystical visions from childhood and wrote theological works including 'Scivias.' Her musical compositions are still performed today, and her medical treatises show remarkable knowledge of herbs and healing. She corresponded with popes and emperors, offering prophetic warnings and spiritual counsel. Her holistic view saw connections between physical and spiritual health.",
    "feastDay": "September 17",
    "born": "1098",
    "died": "1179",
    "patronOf": "Musicians, natural scientists, ecologists",
    "prayer": "St. Hildegard of Bingen, help us see God's presence in creation and use our talents for his glory.",
    "favors": "Help with healing, wisdom in science, and musical inspiration",
    "categories": ["Healing", "Studies"]
  },
  {
    "name": "St. Mechthild of Magdeburg",
    "title": "Beguine Mystic",
    "description": "A German beguine who wrote 'The Flowing Light of the Godhead,' one of the great works of medieval mysticism. She lived as a beguine (semi-religious woman) for forty years before joining a Cistercian convent. Her writings combine mystical poetry with practical spiritual advice, describing the soul's courtly love relationship with God. She experienced both mystical consolations and severe spiritual trials, offering guidance for others walking the mystical path.",
    "feastDay": "November 19",
    "born": "1207",
    "died": "1282",
    "patronOf": "Beguines, mystics, spiritual writers",
    "prayer": "St. Mechthild of Magdeburg, help us experience the flowing light of God's love in our prayer.",
    "favors": "Help with mystical prayer, spiritual writing, and perseverance in trials",
    "categories": ["Studies"]
  }
]