[
  {
    "name": "The Annunciation",
    "title": "Mary's Yes to God",
    "description": "The moment when the Angel Gabriel announced to Mary that she would conceive and bear the Son of God. Mary's response 'Let it be done unto me according to your word' represents perfect openness to God's will. This mystery celebrates God's entrance into human history through Mary's faith and cooperation. The feast commemorates the Incarnation of Jesus Christ and Mary's role as the Mother of God, showing how human cooperation with divine grace can change the world.",
    "feastDay": "March 25",
    "born": "Eternal mystery",
    "died": "Eternal",
    "patronOf": "Vocations, openness to God's will, expectant mothers",
    "prayer": "Through the mystery of the Annunciation, help us say yes to God's will in our lives as Mary did.",
    "favors": "Openness to God's will, guidance in vocations, and grace to say 'yes' in life",
    "categories": ["Family"]
  },
  {
    "name": "The Assumption of Mary",
    "title": "Mary Taken into Heaven",
    "description": "The Catholic doctrine that Mary was taken up body and soul into heaven at the end of her earthly life. This dogma, proclaimed in 1950, affirms that Mary, preserved from original sin, was also preserved from bodily corruption. Her assumption prefigures the resurrection of all the faithful and represents the ultimate dignity of the human person. She continues to intercede for the Church from her place of honor in heaven as Queen of Heaven and Earth.",
    "feastDay": "August 15",
    "born": "Eternal mystery",
    "died": "Eternal",
    "patronOf": "The dying, eternal salvation, bodily resurrection",
    "prayer": "Mary, assumed into heaven, prepare us for our own journey to eternal life and strengthen our hope in resurrection.",
    "favors": "Protection during life and death, favors related to eternal salvation, and strengthening faith in resurrection",
    "categories": ["Family"]
  },
  {
    "name": "The Holy Cross",
    "title": "Tree of Life",
    "description": "The cross on which Jesus died represents the ultimate expression of God's love and the means of humanity's redemption. Veneration of the Holy Cross celebrates how an instrument of torture became the symbol of salvation. Through the cross, Christ conquered sin and death, transforming suffering into a path to glory. The devotion emphasizes taking up one's daily cross and finding meaning in suffering through union with Christ's sacrifice.",
    "feastDay": "September 14",
    "born": "Good Friday",
    "died": "Eternal victory",
    "patronOf": "Those carrying heavy crosses, sufferers, the persecuted",
    "prayer": "By the Holy Cross, you redeemed the world. Help us carry our crosses with faith and find strength in your passion.",
    "favors": "Strength in trials, courage in carrying one's cross, and trust in God's power through suffering",
    "categories": ["Protection"]
  },
  {
    "name": "The Miraculous Medal",
    "title": "Medal of the Immaculate Conception",
    "description": "Based on the vision given to St. Catherine Labouré in 1830, showing Mary standing on a globe with rays of light emanating from her hands. The prayer 'O Mary, conceived without sin, pray for us who have recourse to thee' surrounds her image. The reverse shows the Sacred Heart of Jesus and Immaculate Heart of Mary. Millions wear this medal trusting in Mary's promise of special graces for those who wear it with faith.",
    "feastDay": "November 27",
    "born": "Vision 1830",
    "died": "Eternal",
    "patronOf": "Wearers of the medal, conversions, protection",
    "prayer": "O Mary, conceived without sin, pray for us who have recourse to thee.",
    "favors": "Conversions, healings, protection from physical and spiritual dangers, and sudden miracles",
    "categories": ["Protection", "Healing"]
  },
  {
    "name": "Nativity of Mary",
    "title": "Birth of the Mother of God",
    "description": "The celebration of Mary's birth, traditionally observed on September 8, marks the beginning of our salvation. Though not recorded in Scripture, this feast honors the woman chosen from eternity to be the Mother of God. Her birth represents the dawn of redemption, as she who would bring forth the Light of the World enters human history. The feast celebrates God's preparation of the perfect vessel for the Incarnation through Mary's Immaculate Conception and holy birth.",
    "feastDay": "September 8",
    "born": "Traditional date",
    "died": "Eternal",
    "patronOf": "New beginnings, mothers, children",
    "prayer": "On this feast of your nativity, O Mary, we celebrate the dawn of our salvation and your role in God's plan.",
    "favors": "Graces related to purity, vocations, motherhood, and Marian devotion",
    "categories": ["Family"]
  },
  {
    "name": "Three Hail Marys Devotion",
    "title": "Morning and Evening Prayer",
    "description": "A simple devotion of praying three Hail Marys morning and evening, asking for purity of soul and body, and a holy death. This practice, recommended by many saints, seeks Mary's protection throughout the day and preparation for eternity. St. Mechtilde received a promise that those faithful to this devotion would never die in mortal sin. The three Hail Marys honor the Trinity and seek Mary's intercession for the three greatest needs: purity, perseverance, and a holy death.",
    "feastDay": "Daily devotion",
    "born": "Ancient practice",
    "died": "Eternal",
    "patronOf": "Purity, holy death, daily prayer",
    "prayer": "Hail Mary (three times) for purity of soul and body and for a holy death.",
    "favors": "Purity, protection from mortal sin, and obtaining a holy death",
    "categories": ["Family"]
  },
  {
    "name": "Divine Mercy",
    "title": "Jesus, I Trust in You",
    "description": "Based on the visions of St. Faustina, this devotion centers on God's infinite mercy and the image of Jesus with rays of red and pale light emanating from his heart. The Divine Mercy Chaplet, novena, and feast emphasize trust in God's mercy and mercy toward others. Jesus promised extraordinary graces to those who venerate this image and practice the devotion, especially at the hour of death. The devotion spread worldwide after St. John Paul II's promotion of it.",
    "feastDay": "Divine Mercy Sunday",
    "born": "Vision 1931",
    "died": "Eternal",
    "patronOf": "Mercy, trust, forgiveness",
    "prayer": "Jesus, I trust in You. Eternal Father, I offer You the Body and Blood, Soul and Divinity of Your dearly beloved Son.",
    "favors": "Help with trust in God's mercy, forgiveness, and healing of souls",
    "categories": ["Healing", "Family"]
  },
  {
    "name": "The Holy Family",
    "title": "Jesus, Mary, and Joseph",
    "description": "The devotion to the Holy Family honors Jesus, Mary, and Joseph as the perfect model of family life. This earthly family shows how human families can reflect divine love through mutual service, prayer, and submission to God's will. The Holy Family's life in Nazareth demonstrates the sanctification of ordinary family activities when lived in faith. Their example guides families in facing challenges, practicing virtue, and growing in holiness together.",
    "feastDay": "Sunday after Christmas",
    "born": "Eternal model",
    "died": "Eternal",
    "patronOf": "Families, domestic life, family harmony",
    "prayer": "Holy Family of Nazareth, make our family one with you. Help us live in peace, seek you in all things, and love one another as God loves us.",
    "favors": "Help with family unity, peace, and holy domestic life",
    "categories": ["Family"]
  },
  {
    "name": "The Holy Spirit",
    "title": "Third Person of the Trinity",
    "description": "The Holy Spirit, the third Person of the Trinity, is the Sanctifier who dwells within souls in the state of grace. Devotion to the Holy Spirit seeks his seven gifts: wisdom, understanding, counsel, fortitude, knowledge, piety, and fear of the Lord. The Spirit guides the Church, inspires Scripture, and transforms hearts. Through his action, believers are empowered to live holy lives, discern God's will, and participate in the divine life of the Trinity.",
    "feastDay": "Pentecost",
    "born": "Eternal procession",
    "died": "Eternal",
    "patronOf": "Guidance, wisdom, Church unity, spiritual gifts",
    "prayer": "Come, Holy Spirit, fill our hearts and kindle in us the fire of your love. Send forth your Spirit and we shall be created.",
    "favors": "Help with guidance, wisdom, and spiritual gifts",
    "categories": ["Studies"]
  },
  {
    "name": "Immaculate Conception",
    "title": "Mary Conceived Without Sin",
    "description": "The dogma that Mary was preserved from original sin from the first moment of her conception in preparation for her role as Mother of God. This singular privilege was granted in view of Christ's future merits and prepared her to be a worthy dwelling place for the Son of God. The doctrine emphasizes God's preventive grace and Mary's unique role in salvation history. Her preservation from sin makes her the perfect intercessor and model of purity.",
    "feastDay": "December 8",
    "born": "From conception",
    "died": "Eternal",
    "patronOf": "Purity, United States, freedom from sin",
    "prayer": "O Mary, conceived without sin, pray for us who have recourse to thee. Help us grow in purity and grace.",
    "favors": "Help with purity, protection from sin, and grace of Mary's intercession",
    "categories": ["Family"]
  },
  {
    "name": "Precious Blood of Jesus",
    "title": "Blood of the New Covenant",
    "description": "Devotion to the Precious Blood honors the blood shed by Jesus for humanity's redemption, from his circumcision to his death on the cross. This blood, united to his divinity, has infinite value for the remission of sins and sanctification of souls. The devotion emphasizes the price of redemption and the love shown in Christ's sacrifice. It seeks to make reparation for sins and to apply the merits of Christ's passion to souls in need.",
    "feastDay": "July 1",
    "born": "From Incarnation",
    "died": "Eternal efficacy",
    "patronOf": "Redemption, forgiveness, reparation",
    "prayer": "Precious Blood of Jesus, price of our salvation, wash away our sins and sanctify our souls.",
    "favors": "Help with redemption, healing, and protection from evil",
    "categories": ["Healing", "Protection"]
  }
]