{
  "title": "Day 4",
  "content": "God helps us to be cheerful\n\nSOMETIMES WE HEAR love described as if it were a movement towards self-satisfaction, or merely a means of selfishly fulfilling one's own personality. And I have always thought that true love brings with it joy and peace: the joy of knowing we are loved by God our Father.\n\nThe Forge, no. 28 \n\nCheerfulness is a necessary consequence of our divine filiation, of knowing that our Father God loves us with a love of predilection, that he holds us up and helps us and forgives us. Remember this always: even if it should seem at times that everything around you is collapsing, in fact nothing is collapsing at all, because God doesn't lose battles.\n\nThe Forge, no. 332 \n\nDear God, grant me the grace of experiencing the wonder of the Christian joy you give us as one of the fruits of the Holy Spirit whenever we embrace pain, illness or difficulties with total abandonment in your fatherly arms. Help me understand that happiness is born of love, and that love becomes authentic, like gold in the furnace, through trials and the Cross.\n\nINTENTION \n\nLord, when sickness comes, I tend to become sad and discouraged. Grant me instead the grace to be serene, cheerful, and at peace. Help me to feel the joy of your presence, and in moments of suffering or loneliness, to find you close by, to see your loving hand even in this trial. May illness purify my heart, making it more like yours: compassionate towards others, detached from material goods, rich in the things of heaven.\n\n\n\nPrayer to Saint Josemaria\n\nO GOD, through the mediation of Mary our Mother, you granted your priest Saint Josemaria countless graces, choosing him as a most faithful instrument to found Opus Dei, a way of sanctification in daily work and in the fulfilment of the Christian's ordinary duties. Grant that I too may learn to turn all the circumstances and events of my life into occasions of loving you and serving the Church, the Pope and all souls with joy and simplicity, lighting up the pathways of this earth with faith and love.\n\nDeign to grant me, through the intercession of Saint Josemaria, the favour of... (make your request). AMEN.\n\n Our Father\n\n Hail Mary\n\n Glory be to the Father"
}