{
  "day": 4,
  "title": "Day 4: Emptying Yourself of Self",
  "content": "Preparation for Total Consecration Part I\nTWELVE PRELIMINARY DAYS: SPIRIT OF THE WORLD DAYS 1-12\n\nIntroduction to Part 1 (The First Twelve Preliminary Days)\nFor the first twelve days\n\nExamine your conscience, pray, practice renouncement of your own will; mortification, purity of heart. This purity is the indispensable condition for contemplating God in heaven, to see Him on earth and to know Him by the light of faith. The first part of the preparation should be employed in casting off the spirit of the world which is contrary to that of Jesus Christ. The spirit of the world consists essentially in the denial of the supreme dominion of God; a denial which is manifested in practice by sin and disobedience; thus it is principally opposed to the spirit of Christ, which is also that of Mary.\n\nIt manifests itself by the concupiscence of the flesh, by the concupiscence of the eyes and by the pride of life. By disobedience to God's laws and the abuse of created things. Its works are: sin in all forms, then all else by which the devil leads to sin; works which bring error and darkness to the mind, and seduction and corruption to the will. Its pomps are the splendor and the charms employed by the devil to render sin alluring in persons, places and things.\n\nPRAYER: Come, O Holy Spirit, fill the hearts of your faithful, and kindle in them the fire of Your Divine Love. Send forth Your Spirit, and they shall be created, and You shall renew the face of the earth.\n\nREADING: \"Imitation of Christ, Book 3, Chapter 40\n\nO Lord, all that we have in heaven and on earth is Yours. I offer myself to You as a perpetual oblation in sacrifice of praise, with all that I possess, and give it to You with all the devotion of my heart, O Lord, my God, my Creator, and my Redeemer.\n\nI desire to offer myself to You today as an eternal sacrifice in Your abiding temple. Receive me with the sacred offering of Your precious Body which I also offer to You today in the presence of angels invisibly present, so that it may be for my salvation and the salvation of all Your people.\n\nO Lord I offer You all my sins and offenses which I have committed before You and Your holy angels, from the day I first could sin until this hour, that You may burn and consume them with the fire of Your love, cleanse all the stains of my sins, and restore me to that state of innocence which I lost through sin.\"\n\nREFLECTION: Today we focus on surrendering our self-centeredness. Pride, vanity, and self-sufficiency prevent us from receiving God's grace. In this consecration journey, we learn from Mary's perfect humility and self-gift to God. Through her intercession, we too can learn to empty ourselves of self-interest and make room for God's presence.\n\nDAILY PRACTICE: Make a deliberate act of humility today. Accept a criticism without defending yourself, perform a hidden act of service, or let someone else receive praise or recognition for something you helped accomplish.\n\nCONSECRATION PRAYER: O Mary, Virgin most powerful and Mother of Mercy, Queen of Heaven and Refuge of Sinners, I consecrate myself to your Immaculate Heart. I consecrate to you my body and soul, my goods, both interior and exterior, and even the value of all my good actions, past, present and future, leaving to you the entire and full right of disposing of me and all that belongs to me, without exception, according to your good pleasure, for the greater glory of God, in time and in eternity. Amen."
}