{
  "day": 5,
  "title": "Day 5: Recognizing the Empty Promises of Pride",
  "content": "Preparation for Total Consecration Part I\nTWELVE PRELIMINARY DAYS: SPIRIT OF THE WORLD DAYS 1-12\n\nIntroduction to Part 1 (The First Twelve Preliminary Days)\nFor the first twelve days\n\nExamine your conscience, pray, practice renouncement of your own will; mortification, purity of heart. This purity is the indispensable condition for contemplating God in heaven, to see Him on earth and to know Him by the light of faith. The first part of the preparation should be employed in casting off the spirit of the world which is contrary to that of Jesus Christ. The spirit of the world consists essentially in the denial of the supreme dominion of God; a denial which is manifested in practice by sin and disobedience; thus it is principally opposed to the spirit of Christ, which is also that of Mary.\n\nIt manifests itself by the concupiscence of the flesh, by the concupiscence of the eyes and by the pride of life. By disobedience to God's laws and the abuse of created things. Its works are: sin in all forms, then all else by which the devil leads to sin; works which bring error and darkness to the mind, and seduction and corruption to the will. Its pomps are the splendor and the charms employed by the devil to render sin alluring in persons, places and things.\n\nPRAYER: Come, O Holy Spirit, fill the hearts of your faithful, and kindle in them the fire of Your Divine Love. Send forth Your Spirit, and they shall be created, and You shall renew the face of the earth.\n\nREADING: \"Imitation of Christ, Book 3, Chapter 40\n\nWherefore, but I did know well, how to cast from me all human comfort, either for the sake of devotion, or through the necessity by which I am compelled to seek Thee, because there is no hope in Thy favor, and rejoice in the gift of a new consolation.\n\nThanks be to Thee from Whom all things proceed, as often as it happens to me, I, indeed, am but vanity, and nothing in Thy sight, an inconstant and weak man. Where, therefore, can I glory, or for what do I desire to be though of highly?\n\nForsooth of my very nothingness; and this is most vain. Truly vainglory is an evil plague, because it draws away from true glory, and robs us of heavenly grace. For, while a man takes complacency in himself, he displeases Thee; while he wants for human applause, he is deprived of true virtues.\n\nBut true, glory and holy exultation is to glory in Thee, and not in one's self; to rejoice in Thy Name, but not in one's own strength. To find pleasure in no creature, save only for Thy sake. Let Thy Name be praised, not mine: let Thy work be magnified, not mine; let Thy Holy Name be blessed, but let nothing be attributed to me of the praise of men. Thou art my glory; Thou art the exultation of my heart; in Thee, will I glory and rejoice all the day; but for myself, I will glory in nothing but in my infirmities.\"\n\nREFLECTION: Today we contemplate how pride blinds us to the truth of our dependence on God. Pride makes us seek glory for ourselves rather than giving glory to God. As we prepare for consecration to Mary, we seek to imitate her profound humility. She never sought recognition or praise but always directed all glory to God.\n\nDAILY PRACTICE: Identify one area where pride affects your relationship with God or others. Make a resolution to practice humility specifically in this area today. Consider beginning and ending your day with the Magnificat, Mary's song of humble praise.\n\nCONSECRATION PRAYER: O Mary, Virgin most powerful and Mother of Mercy, Queen of Heaven and Refuge of Sinners, I consecrate myself to your Immaculate Heart. I consecrate to you my body and soul, my goods, both interior and exterior, and even the value of all my good actions, past, present and future, leaving to you the entire and full right of disposing of me and all that belongs to me, without exception, according to your good pleasure, for the greater glory of God, in time and in eternity. Amen."
}