{
  "day": 6,
  "title": "Day 6: Detachment from Material Possessions",
  "content": "Preparation for Total Consecration Part I\nTWELVE PRELIMINARY DAYS: SPIRIT OF THE WORLD DAYS 1-12\n\nIntroduction to Part 1 (The First Twelve Preliminary Days)\nFor the first twelve days\n\nExamine your conscience, pray, practice renouncement of your own will; mortification, purity of heart. This purity is the indispensable condition for contemplating God in heaven, to see Him on earth and to know Him by the light of faith. The first part of the preparation should be employed in casting off the spirit of the world which is contrary to that of Jesus Christ. The spirit of the world consists essentially in the denial of the supreme dominion of God; a denial which is manifested in practice by sin and disobedience; thus it is principally opposed to the spirit of Christ, which is also that of Mary.\n\nIt manifests itself by the concupiscence of the flesh, by the concupiscence of the eyes and by the pride of life. By disobedience to God's laws and the abuse of created things. Its works are: sin in all forms, then all else by which the devil leads to sin; works which bring error and darkness to the mind, and seduction and corruption to the will. Its pomps are the splendor and the charms employed by the devil to render sin alluring in persons, places and things.\n\nPRAYER: Come, O Holy Spirit, fill the hearts of your faithful, and kindle in them the fire of Your Divine Love. Send forth Your Spirit, and they shall be created, and You shall renew the face of the earth.\n\nREADING: \"Then Jesus said to his disciples, 'Truly I tell you, it is hard for someone who is rich to enter the kingdom of heaven. Again I tell you, it is easier for a camel to go through the eye of a needle than for someone who is rich to enter the kingdom of God.'\" (Matthew 19:23-24)\n\nREFLECTION: Today we examine our relationship with material possessions. The spirit of the world convinces us that happiness comes from accumulating things, but Mary teaches us the freedom that comes from simplicity and trust in Divine Providence. She who was chosen to be the Mother of God lived in humble circumstances, showing us that true wealth lies in spiritual riches.\n\nDAILY PRACTICE: Choose one material possession you are particularly attached to and either give it away, donate it, or simply spend the day without using it. Reflect on how this detachment feels and offer any anxiety to Mary.\n\nCONSECRATION PRAYER: O Mary, Virgin most powerful and Mother of Mercy, Queen of Heaven and Refuge of Sinners, I consecrate myself to your Immaculate Heart. I consecrate to you my body and soul, my goods, both interior and exterior, and even the value of all my good actions, past, present and future, leaving to you the entire and full right of disposing of me and all that belongs to me, without exception, according to your good pleasure, for the greater glory of God, in time and in eternity. Amen."
}