{
  "saint_id": 1,
  "prayers": [
    {
      "day": 1,
      "title": "St. Joseph (Husband of Mary) - Day 1",
      "prayer": "In the name of the Father, and of the Son, and of the Holy Spirit. Amen.\n\nIntro Prayer:\n\nSaint Joseph, I, your unworthy child, greet you. You are the faithful protector and intercessor of all who love and venerate you. You know that I have special confidence in you and that, after Jesus and Mary, I place all my hope of salvation in you, for you are especially powerful with God and will never abandon your faithful servants.\n\nTherefore I humbly invoke you and commend myself, with all who are dear to me and all that belong to me, to your intercession. I beg of you, by your love for Jesus and Mary, not to abandon me during life and to assist me at the hour of my death. Glorious Saint Joseph, spouse of the Immaculate Virgin, obtain for me a pure, humble, charitable mind, and perfect resignation to the divine Will. Be my guide, my father, and my model through life that I may merit to die as you did in the arms of Jesus and Mary.\n\nLoving Saint Joseph, faithful follower of Jesus Christ, I raise my heart to you to implore your powerful intercession in obtaining from the Divine Heart of Jesus all the graces necessary for my spiritual and temporal welfare, particularly the grace of a happy death, and the special grace I now implore:\n\n(Mention your request).\n\nGuardian of the Word Incarnate, I feel confident that your prayers on my behalf will be graciously heard before the throne of God. Amen.\n\nDaily Prayer:\n\nSaint Joseph, I thank God for your privilege of having been chosen by God to be the foster-father of His Divine Son. As a token of your own gratitude to God for this your greatest privilege, obtain for me the grace of a very devoted love for Jesus Christ, my God and my Savior. Help me to serve Him with some of the self-sacrificing love and devotion which you had while on this earth with Him. Grant that through your intercession with Jesus, your foster-Son, I may reach the degree of holiness which God expects of me and thus be united with you forever in heaven.\n\nConcluding Prayer:\n\nRemember, most pure spouse of Mary, ever Virgin, my loving protector, Saint Joseph, that no one ever had recourse to your protection or asked for your aid without obtaining relief. Confiding, therefore, in your goodness, I come before you and humbly implore you. Despise not my petitions, foster-father of the Redeemer, but graciously receive them. Amen."
    }
  ]
}